{
  "name": "Pariah (Septicemia)",
  "model": "B",
  "tonnage": 55,
  "techBase": "Clan",
  "rulesLevel": "2",
  "engine": "275 XL (Clan) Engine(IS)",
  "heatSinks": "14 Double",
  "movement": {
    "walk": "5",
    "jump": "7"
  },
  "armor": {
    "total": "Ferro-Fibrous(Clan)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "Clan Endo Steel",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3075"
  ],
  "extras": {
    "mul id": "5020",
    "Config": "Biped Omnimech",
    "role": "Skirmisher",
    "quirk": "bad_rep_clan",
    "Myomer": "Standard",
    "Base Chassis Heat Sinks": "11",
    "LA Armor": "18",
    "RA Armor": "18",
    "LT Armor": "18",
    "RT Armor": "18",
    "CT Armor": "23",
    "HD Armor": "8",
    "LL Armor": "24",
    "RL Armor": "24",
    "RTL Armor": "7",
    "RTR Armor": "7",
    "RTC Armor": "7",
    "Weapons": "5",
    "overview": "The backbone of The Society's military forces, the Septicemia was a utilitarian medium-class workhorse. Devoid of the more experimental technology utilized by the Cephalus and Osteon to allow it to be built in higher volumes, the Septicemia saves weight with an XL Engine, Endo Steel chassis, and nine tons of Ferro-Fibrous armor. While the location of its weaponry in its torsos hampers its ability to carry Battle Armor, this was intentional to try and ensure hand actuators were retained to maximize its physical combat abilities.",
    "capabilities": "The third configuration excels at close-quarters combat in restricted terrain, such as an urban environment. Seven improved jump jets enable the Septicemia to leap up to 210 meters in the air. Two Large Pulse Lasers and three Small Pulse Lasers allow the MechWarrior to make full use of the 'Mech's jumping capabilities and still be accurate. Additional heat sinks keep heat levels under control.",
    "deployment": "Planning their OmniMech forces around a single mass-produced design intended to work in concert with two rarer but cutting-edge units, the Septicemia was built using proven technology with a focus towards mutual support on the battlefield, its every aspect intended to allow it to engage the Clan toumans using methods of warfare they found dezgra. Appearing during the Wars of Reaving when Clan warriors were even more intent on an exceedingly strict adherence of zellbrigen to avoid accusations of Taint, the Septicemia would prove frighteningly effective, earning it the nickname of \"Pariah\" by the Clan Diamond Shark forces that first faced it on Babylon in 3072.",
    "history": "Despite its role in the Wars of Reaving, the Septicemia would see service after the conflict in the toumans of the four surviving Homeworld Clans. Avoiding extinction unlike the Cephalus and Osteon due to the capture of its production plant and lack of integrated Nova Combined Electronic Warfare System, while the other surviving Clans would push for a renaming of the Septicemia to excise its Taint (Void and Codex being popular suggestions), Khan Magnus DelVillar from Clan Stone Lion successfully campaigned against any moves to rename or remodel the design, citing that it would serve as a constant reminder of the dark crucible from which the Clans had emerged.",
    "manufacturer": "Kerensky Memorial Manufacturing",
    "primaryfactory": "Strana Mechty",
    "systemmanufacturer": "TARGETING:Cat’s Eye MD7"
  },
  "era": "3072",
  "displayName": "Pariah (Septicemia) B",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}