{
  "name": "Perseus",
  "model": "P1A",
  "tonnage": 75,
  "techBase": "Inner Sphere",
  "rulesLevel": "2",
  "engine": "300 XL Engine(IS)",
  "heatSinks": "12 Double",
  "movement": {
    "walk": "4",
    "jump": "0"
  },
  "armor": {
    "total": "Standard(Inner Sphere)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "IS Endo Steel",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3067"
  ],
  "extras": {
    "mul id": "4809",
    "Config": "Biped Omnimech",
    "role": "Missile Boat",
    "quirk": "easy_maintain",
    "Myomer": "Standard",
    "Base Chassis Heat Sinks": "12",
    "LA Armor": "21",
    "RA Armor": "21",
    "LT Armor": "24",
    "RT Armor": "24",
    "CT Armor": "36",
    "HD Armor": "9",
    "LL Armor": "32",
    "RL Armor": "32",
    "RTL Armor": "8",
    "RTR Armor": "8",
    "RTC Armor": "9",
    "Weapons": "6",
    "overview": "The Perseus is the product of a program begun by the League Central Coordination and Command to create an OmniMech completely indigenous to the Free Worlds League from concept to production.",
    "capabilities": "While on paper the Perseus is a capable 'Mech with forty-tons of available pod space, the design has earned something of a lackluster reputation when compared to other modern OmniMechs such as the Templar or Hauptmann. This is largely due to the small size of it's weapon bays which limit the type of weaponry of the Perseus can mount, only the arms can carry larger autocannons and the hand and lower-arm actuators must be removed to be able do so, with a number of configurations also forced to mount weaponry in the 'Mech's legs. More critically the small size of the bays hampers the volume of extra double heat sinks that can be carried, consequently most of the Perseus's configurations utilize ballistic and missile weaponry over more heat-intensive energy loadouts. Built on a lightweight Endo Steel chassis, the Perseus is powered by a Hermes 300 XL engine helping save even more weight and giving the 'Mech a top speed of 64.8 km/h. The advanced structure and engine save a great deal of weight for weapons and equipment. The Perseus is protected by fourteen tons of Valiant Lamellor armor, giving it around average armor protection for a 'Mech of its size. It also has twelve double heat sinks that are fixed on the chassis.",
    "deployment": "Configured for long range fire support, the A configuration carries a pair of LRM-20 launchers in its arm, both of which are linked to an Artemis IV FCS for increased accuracy. For close range defense, the 'Mech carries two Medium Pulse Lasers and has an SRM-6 launcher linked to an Artemis IV FCS. The 'Mech also has a leg-mounted TAG laser designator, allowing it to call in Semi-Guided LRM and Arrow IV attacks from friendly units and has an ECM Suite to defend itself from enemy electronic warfare systems.",
    "history": "The Perseus shares much with the venerable Orion, a staple of Free Worlds League Military, both broadly resembling the older design visually and using a number of the same components. This similarity prompted more than a few FWLM technicians to nickname the new design the \"Omni-Orion\" and the deployment of Perseus has largely been to front-line units that fielded large concentrations of its progenitor, replacing older Orions on a one-for-one basis.",
    "manufacturer": "Kali Yama Weapons Industries",
    "primaryfactory": "Kalidasa",
    "systemmanufacturer": "TARGETING:Wasat Aggressor Type 5 with OmniLink"
  },
  "era": "3058",
  "displayName": "Perseus P1A",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}