{
  "name": "Raijin",
  "model": "RJN-101-A",
  "tonnage": 50,
  "techBase": "Inner Sphere",
  "rulesLevel": "2",
  "engine": "300 XL Engine(IS)",
  "heatSinks": "10 IS Double",
  "movement": {
    "walk": "6",
    "jump": "6"
  },
  "armor": {
    "total": "Ferro-Fibrous(Inner Sphere)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "IS Standard",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3055"
  ],
  "extras": {
    "mul id": "2626",
    "Config": "Biped",
    "role": "Striker",
    "quirk": "bad_rep_is",
    "weaponquirk": "direct_torso_mount:LA:4:ISMediumPulseLaser",
    "myomer": "Standard",
    "LA armor": "13",
    "RA armor": "13",
    "LT armor": "13",
    "RT armor": "13",
    "CT armor": "18",
    "HD armor": "9",
    "LL armor": "13",
    "RL armor": "13",
    "RTL armor": "6",
    "RTR armor": "6",
    "RTC armor": "8",
    "Weapons": "6",
    "overview": "The Raijin is designed to be highly mobile and capable of engaging an enemy at a variety of ranges.",
    "capabilities": "The 'Mech's relatively light armor can be a liability if it is engaged in close combat or finds itself in a protracted engagement.",
    "deployment": "The Raijin is built around a Vlar 300 XL Engine that gives it a top speed of 97.2 km/h. For added mobility, the Raijin carries six Rawlings 60 jump jets, allowing the 'Mech to jump up to one hundred and eighty meters. The Raijin carries seven tons of Krupp 200 Ferro-Fibrous armor. For long-range striking power, the Raijin carries a Blankenburg 200 ER PPC that can be used to engage a target at up to six hundred and ninety meters. For close combat, the Raijin has three highly accurate Blankenburg Technologies Medium Pulse Lasers. Additionally, to seek out any weak points in an enemy's armor, the Raijin has a Holly SRM-6 and an ammunition efficient Holly Streak SRM-2.",
    "history": "The Raijin was designed after the Battle of Tukayyid to rearm ComGuard units that had suffered losses in the campaign. Despite having stockpiled Star League-era BattleMechs at his disposal, Precentor Martial Focht wanted something unfamiliar to both the Inner Sphere and the Clans. The Raijin was redesigned after Word of Blake forces lost considerable amounts of the design during its taking of Terra from ComStar in 3058. Newly redesigned Raijin II units began to be deployed in 3066, with older versions of the 'Mech being refitted to RJN-200-A variant standards. While off-shoots of the 200-A were deployed to elite Divisions.",
    "manufacturer": "Krupp Armament Works",
    "primaryfactory": "Terra",
    "systemmanufacturer": "TARGETING:Garret T12A"
  },
  "era": "3053",
  "displayName": "Raijin RJN-101-A",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}