{
  "name": "Ryoken",
  "model": "F",
  "tonnage": 55,
  "techBase": "Clan",
  "rulesLevel": "2",
  "engine": "330 XL (Clan) Engine(IS)",
  "heatSinks": "12 Double",
  "movement": {
    "walk": "6",
    "jump": "0"
  },
  "armor": {
    "total": "Ferro-Fibrous(Clan)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "Clan Endo Steel",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3050"
  ],
  "extras": {
    "clanname": "Stormcrow",
    "mul id": "2754",
    "Config": "Biped Omnimech",
    "role": "Striker",
    "quirk": "stable",
    "Myomer": "Standard",
    "Base Chassis Heat Sinks": "10",
    "LA Armor": "18",
    "RA Armor": "18",
    "LT Armor": "17",
    "RT Armor": "17",
    "CT Armor": "25",
    "HD Armor": "9",
    "LL Armor": "25",
    "RL Armor": "25",
    "RTL Armor": "9",
    "RTR Armor": "9",
    "RTC Armor": "10",
    "Weapons": "12",
    "overview": "The Stormcrow is a wide-spread, second generation OmniMech fielded by many Clans. However, within the Clan Smoke Jaguar touman, the Stormcrow was especially common during the Clan Invasion and was codenamed the Ryoken（a misspelling of ryōken - hunting dog) by the warriors of the DCMS who encountered it. Because of its versatility through its combination of mobility, armor, and firepower in its various configurations, the Stormcrow is a feared opponent on the battlefield.",
    "capabilities": "The Stormcrow is built on a lightweight Endo Steel chassis and is powered by a 330 XL engine that propels it to a top speed of 97.2 km/h. The Stormcrow is protected by nine and a half tons of Ferro-Fibrous armor, giving the 'Mech the ability to survive encounters with other units that it isn't capable of outpacing.",
    "deployment": "This variant uses a pair of arm-mounted plasma cannons that increase the target's heat. In addition to its capabilities as an anti-infantry unit, the 'Mech also has a pair of anti-personnel Gauss rifles in each arm, making the Stormcrow F devastating against unarmored infantry. For use against hardened targets, it has four ER medium lasers and two ER small lasers, with a pair of extra heat sinks.",
    "history": "The Stormcrow was designed by Clan Hell's Horses and debuted during the Battle of Tokasha. It is also implied that Stormcrow prototypes were produced on Tokasha at Tokasha MechWorks. However, prototypes of the Stormcrow had only just debuted when Clan Ghost Bear won Tokasha through the Battle of Tokasha. As a result of the upheaval, design copies and moulds for the Stormcrow were scattered throughout Clan space. The final production version of the Stormcrow debuted in 2930, when Clan Snow Raven scientists finished with a series of minor design changes and rechristened the OmniMech.",
    "manufacturer": "Industrial Complex Alpha, Various",
    "primaryfactory": "Dante,Various",
    "systemmanufacturer": "TARGETING:Tokasha B4-T&T"
  },
  "era": "3069",
  "displayName": "Ryoken F",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}