{
  "name": "Akuma",
  "model": "AKU-1X",
  "tonnage": 90,
  "techBase": "Inner Sphere",
  "rulesLevel": "2",
  "engine": "270 Fusion Engine(IS)",
  "heatSinks": "13 IS Double",
  "movement": {
    "walk": "3",
    "jump": "0"
  },
  "armor": {
    "total": "Standard(Inner Sphere)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "IS Endo Steel",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3067"
  ],
  "extras": {
    "mul id": "3691",
    "Config": "Biped",
    "role": "Juggernaut",
    "quirk": "easy_maintain",
    "myomer": "Standard",
    "LA armor": "30",
    "RA armor": "30",
    "LT armor": "28",
    "RT armor": "28",
    "CT armor": "43",
    "HD armor": "9",
    "LL armor": "38",
    "RL armor": "38",
    "RTL armor": "10",
    "RTR armor": "10",
    "RTC armor": "15",
    "Weapons": "7",
    "overview": "A low-cost alternative to the Atlas-K: the AKU-1X Akuma.",
    "capabilities": "Akuma was smaller and lighter than an Atlas to minimize costs. The lighter fusion engine saved money. Despite its tiny size, the Akuma has comparable armor protection and ground speed. The 'Mech's enormous mask makes it look like the monster it's named after. The Combine MechWarrior fires first after the Akuma scares the adversary. Advanced weaponry function best at short and medium ranges on the 'Mech. The 'Mech's poor speed doesn't matter because it's designed for defense or slow advances against static or dug-in opponents.",
    "deployment": "The Akuma carries a Lord's Light 2 ER PPC and a powerful Imperator Code Red LB-X Autocannon/10 as its primary long-range weapons. The latter weapon gives it a good amount of flexibility in engaging targets as the autocannon can fire both solid and cluster ammunition. For medium to close range combat, the Akuma has a Shigunga MRM-30 launcher and two highly accurate short range missile launchers produced by Guided Technologies; a 2nd Gen Streak SRM-6 and a 2nd Gen Streak SRM-4 launcher. Finally, a Victory 23R medium laser and a Victory Heartbeat Medium Pulse Laser round out the Akumas eclectic and effective weapons payload.",
    "history": "During the Clan invasion, Theodore Kurita issued a broad plea to manufacturers to develop more cost-effective BattleMechs, both in terms of original investment and ongoing maintenance. Independence Weaponry, known for their heavy and assault 'Mechs, reacted with the AKU-1X Akuma, a low-cost counterpart to their own Atlas-K. The Akuma shares several components with the original Atlas-D and has a price tag comparable to it. Independence Weaponry decreased the overall cost of both units by increasing demand for the same set of parts. The Ryuken-go have always been the most vocal supporters of the Akuma, fielding it in a variety of attack lances. Other front-line units were slow to embrace the Akuma until it demonstrated its worth during the assault on Clan Smoke Jaguar, and demand has since outstripped supply. The Akuma 1XJ recently made its debut in the counterassaults that eventually took the Davion worlds of Breed and Kesai IV in Duke Robinson's ill-fated onslaught against the Combine.",
    "manufacturer": "Independence Weaponry",
    "primaryfactory": "Quentin",
    "systemmanufacturer": "TARGETING:Matabushi Sentinel"
  },
  "era": "3058",
  "displayName": "Akuma AKU-1X",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}