{
  "name": "Annihilator",
  "model": "ANH-3A",
  "tonnage": 100,
  "techBase": "Inner Sphere",
  "rulesLevel": "2",
  "engine": "200 Compact Engine",
  "heatSinks": "12 Double",
  "movement": {
    "walk": "2",
    "jump": "0"
  },
  "armor": {
    "total": "Light Ferro-Fibrous(Inner Sphere)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "Standard",
  "cockpit": null,
  "gyro": "Compact Gyro",
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3050"
  ],
  "extras": {
    "mul id": "41",
    "Config": "Biped",
    "role": "Juggernaut",
    "quirk": "easy_maintain",
    "Myomer": "Standard",
    "LA Armor": "34",
    "RA Armor": "34",
    "LT Armor": "32",
    "RT Armor": "32",
    "CT Armor": "46",
    "HD Armor": "9",
    "LL Armor": "42",
    "RL Armor": "42",
    "RTL Armor": "10",
    "RTR Armor": "10",
    "RTC Armor": "16",
    "Weapons": "8",
    "overview": "Originally developed in the final year of the Amaris Civil War as the ultimate fixed position city defense BattleMech.",
    "capabilities": "The Annihilator is armed with an arsenal that is built to instill fear in an enemy as much as damage them. The 100-ton 'Mech has a maximum speed of 32.4 km/h, making it one of the slowest 'Mechs ever designed together with the UrbanMech. It is by no means intended to use speed to outmaneuver an enemy, instead depending on its twelve and a half tons of armor to weather any fire that is directed at the 'Mech.",
    "deployment": "This upgrade made use of double heat sinks and used the tonnage saved to max out the armor on the Annihilator. Offensively, four ER Medium Lasers and eight Light Autocannon/2s were incredibly accurate thanks to the inclusion of a Targeting Computer. Ample autocannon ammunition (five tons) allowed flexibility when choosing special munitions, making this 'Mech very effective against vehicles. To fit all this equipment, a Compact Engine and Compact Gyro are mounted in the center torso. The 'Mech is protected by Light Ferro Fibrous armor and CASE.",
    "history": "The Annihilator was built as a sign of the military strength of both the Star League in Exile and the newly created Clans. Discontinued before the Clans' Golden Century, in one of their few missteps, the Wolf's Dragoons brought a number of unknown designs with them in 3009, raising more questions to their origins while at the same time adding to their mystique. It was exclusive to the Dragoons until the Jihad disseminated the design to Arc-Royal due to the strengthening of the relationship that Wolf's Dragoons forged with the Kell Hounds and Clan Wolf-in-Exile following their flight from Outreach.",
    "manufacturer": "Arc-Royal MechWorks",
    "primaryfactory": "Arc-Royal",
    "systemmanufacturer": "TARGETING:Wasat Aggressor Type 5"
  },
  "era": "3068",
  "displayName": "Annihilator ANH-3A",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}