{
  "name": "Barghest",
  "model": "BGS-2T",
  "tonnage": 70,
  "techBase": "Inner Sphere",
  "rulesLevel": "2",
  "engine": "350 XL Engine",
  "heatSinks": "11 Double",
  "movement": {
    "walk": "5",
    "jump": "0"
  },
  "armor": {
    "total": "Standard(Inner Sphere)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "Standard",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3060"
  ],
  "extras": {
    "mul id": "253",
    "Config": "Quad",
    "role": "Skirmisher",
    "quirk": "directional_torso_mount",
    "Myomer": "Standard",
    "FLL Armor": "29",
    "FRL Armor": "29",
    "LT Armor": "22",
    "RT Armor": "22",
    "CT Armor": "33",
    "HD Armor": "9",
    "RLL Armor": "28",
    "RRL Armor": "28",
    "RTL Armor": "7",
    "RTR Armor": "7",
    "RTC Armor": "10",
    "Weapons": "2",
    "overview": "During her reign over the Lyran Alliance, Katherine Steiner-Davion decided she wanted a four-legged BattleMech that would frighten its adversaries in the same way that the classic Atlas and Banshee designs did.",
    "capabilities": "The Earthwerk GRF Quad chassis accommodates a Magna 350 XL engine, which saves weight and lets the 'Mech to carry a hefty weapons payload. The Barghest is shielded by thirteen tons of Durallex Heavy armor, which shields it from all but the most powerful enemy fire. The Barghest features ten double heat sinks to handle the 'Mech's heat buildup from its weaponry.",
    "deployment": "The 2T removes the weapons of the 1T model and replaces them with a single ER PPC and an Ultra Autocannon/20. The ultra autocannon is capable of firing at twice the rate as a standard autocannon, giving the 2T an incredible amount of short range firepower. The Barghest has also gained an additional ton of armor protection, making the 'Mech even harder to take down on the battlefield.",
    "history": "Katrina Steiner, Archon of the Lyran Alliance, created this novel and distinctive design. The Archon notified Tharkad's TharHes Industries that she desired to build a new design with a horrific appearance, similar to that of the Atlas or the Banshee. She also desired a four-legged design. TharHes executives tried unsuccessfully to persuade her to abandon the quad design, which has been heavily criticized for decades. TharHes Industries only realized the political and military consequences of a new quad design in the Lyran Alliance Armed Forces during the final testing of the new 'Mech, when new four-legged designs debuted in the Draconis Combine and Free Worlds League militaries. The Archon dubbed the finished 'Mech Barghest after the fierce, wolf-like monsters of folklore, after seeing its animalistic elegance and power.",
    "manufacturer": "TharHes Industries",
    "primaryfactory": "Tharkad",
    "systemmanufacturer": "TARGETING:TharHes Ares-8a"
  },
  "era": "3060",
  "displayName": "Barghest BGS-2T",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}