{
  "name": "Blackjack",
  "model": "BJ2-O",
  "tonnage": 50,
  "techBase": "Inner Sphere",
  "rulesLevel": "2",
  "engine": "200 XL Engine(IS)",
  "heatSinks": "10 IS Double",
  "movement": {
    "walk": "4",
    "jump": "4"
  },
  "armor": {
    "total": "Standard(Inner Sphere)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "IS Endo Steel",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3058"
  ],
  "extras": {
    "mul id": "378",
    "Config": "Biped Omnimech",
    "role": "Brawler",
    "quirk": "non_standard",
    "myomer": "Standard",
    "base chassis heat sinks": "8",
    "LA armor": "14",
    "RA armor": "14",
    "LT armor": "18",
    "RT armor": "18",
    "CT armor": "22",
    "HD armor": "9",
    "LL armor": "18",
    "RL armor": "18",
    "RTL armor": "6",
    "RTR armor": "6",
    "RTC armor": "9",
    "Weapons": "10",
    "overview": "An upgrade of the Blackjack BattleMech, the Blackjack OmniMech is a powerful and adaptable medium weight workhorse.",
    "capabilities": "Weighing five tons heavier than its parent design, the use of advanced construction materials gives the OmniMech Blackjack 26.5 tons of pod space, allowing it to carry an impressive weapons payload. A maneuverable and enduring design for its size, four permanently mounted Icarus jump jets that allow the Blackjack to jump up to one hundred and twenty meters, the 'Mech protected by nine-and-a-half tons of armor. The Blackjack is also built with a weight saving Alshain 50 Endo Steel chassis and a Nissan 200 XL Engine giving it a top speed of 64.8 kph.",
    "deployment": "The primary configuration of the Blackjack is armed for long range combat, with a pair of UAC/5s that can put twice as much volume of fire downrange as a standard AC/5. For close combat, the Blackjack carries four medium lasers, and four machine guns defend the 'Mech against infantry attacks.",
    "history": "Much like the Firestarter OmniMech, the genesis of the omni-Blackjack stems from the Combine's technology exchange program during the initial Clan Invasion with Ceres Metals Industries ' St. Ives Compact branch offering Luthien Armor Works specifications and licences to manufacturer the ill-regarded Blackjack. Even though it received the upgraded and more effective BJ-2 version, LAW manufactured only a few examples before reworking and retooling the line to manufacture an OmniMech version. As well as returning the updated Omni version to Ceres, LAW also exported the BJ2-0 Blackjack to the Free Worlds League's Irian BattleMechs Unlimited, making it the first OmniMech exported for manufacturing. Any goodwill LAW earned from this decision was short-lived when both IBMU and CMI discovered the first production runs of their Blackjacks could only mount Inner Sphere OmniPods, accusing the Combine of only exporting so-called \"monkey\" versions, the Combine company's claims of not having perfected the complex software interfaces to support Clan weapons when the plans were exported ringing hollow when Draconis Combine Mustered Soldiery Blackjacks did not suffer from this lack. LAW eventually offered up the required details allowing both companies to resolve the issue in future production runs with earlier versions being upgraded during their first major overhaul.",
    "manufacturer": "Irian BattleMechs Unlimited,Luthien Armor Works,General Motors/Blackwell Corporation,Irian BattleMechs Unlimited,Ceres Metals Industries,Ceres Metals Industries",
    "primaryfactory": "Irian,Luthien,New Valencia,Shiro III,St. Ives,Warlock",
    "systemmanufacturer": "TARGETING:Matabushi Sentinel"
  },
  "era": "3057",
  "displayName": "Blackjack BJ2-O",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}