{
  "name": "Black Hawk-KU",
  "model": "BHKU-OD",
  "tonnage": 60,
  "techBase": "Inner Sphere",
  "rulesLevel": "2",
  "engine": "300 XL Engine(IS)",
  "heatSinks": "14 Double",
  "movement": {
    "walk": "5",
    "jump": "5"
  },
  "armor": {
    "total": "Standard(Inner Sphere)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "IS Standard",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3058"
  ],
  "extras": {
    "mul id": "350",
    "Config": "Biped Omnimech",
    "role": "Missile Boat",
    "quirk": "easy_maintain",
    "Myomer": "Standard",
    "Base Chassis Heat Sinks": "12",
    "LA Armor": "20",
    "RA Armor": "20",
    "LT Armor": "20",
    "RT Armor": "20",
    "CT Armor": "30",
    "HD Armor": "9",
    "LL Armor": "28",
    "RL Armor": "28",
    "RTL Armor": "8",
    "RTR Armor": "8",
    "RTC Armor": "9",
    "Weapons": "2",
    "overview": "<p>The Black Hawk-KU, an Inner Sphere adaptation of the Clan's Black Hawk OmniMech, emerged from the Draconis Combine's endeavor to bridge the technological divide post the battle for Wolcott. The design, although ten tons heavier, mirrors its Clan counterpart's performance profile, showcasing a blend of agility, speed, and lethal armament flexibility.</p>",
    "capabilities": "<p>The Black Hawk-KU is recognized for its speed and agility despite its size, making it a formidable and versatile weapons platform. Its design supports various standard configurations courtesy of its pod technology, allowing customization to cater to mission requirements and pilot preferences. The configurations range from mirroring the Clan original to optimizing the strengths and weaknesses of Inner Sphere weapons systems. The utilization of standard weapons in many configurations helps in better heat management, thus reducing the chances of heat-induced shutdowns following alpha strikes, albeit at the cost of range and firepower. The model features a Vlar 300 XL engine, nearly maximum armor protection, five jump jets across configurations, and fourteen double heat sinks to manage substantial heat generated, especially pronounced in alternate configurations.</p>",
    "deployment": "<p>A fire-support variant, it carries an LRM-20 launcher for indirect fire support, complemented by an ER Large Laser for direct long-range engagements.</p>",
    "history": "<p>The inception of the Black Hawk-KU is rooted in the aftermath of the battle for Wolcott, where the Draconis Combine managed to obtain several Clan OmniMechs. This acquisition spurred a crash program to develop OmniMechs, leading to the birth of the Black Hawk-KU. Luthien Armor Works played a pivotal role in replicating the Clan's Black Hawk design, employing available technologies to a significant extent. Although the resultant design necessitated a ten-ton heavier build to accommodate a robust engine and chassis, it achieved a performance profile comparable to its Clan sibling. The Black Hawk-KU went through initial field tests with the Legion of Vega and saw action against Clan Smoke Jaguar, later serving with distinction in the Ghost Bear incursion and conflicts against the Federated Suns. This combat history, coupled with its diverse configurations, not only demonstrated its resilience and adaptability on the battlefield but also underscored its contribution in narrowing the technological gap between Inner Sphere and Clan technologies.</p>",
    "manufacturer": "Coventry,Crofton,Loburg,Luthien,Marduk,New Avalon,Son Hoa,St. Ives",
    "primaryfactory": "Coventry Metal Works,StarCorps Industries,Luthien Armor Works - OmniMech Production Facility,Victory Industries (formerly Norse BattleMech Works),Corean Enterprises,StarCorps Industries",
    "systemmanufacturer": "TARGETING:Matabushi Sentinel Plus"
  },
  "era": "3055",
  "displayName": "Black Hawk-KU BHKU-OD",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}