{
  "name": "Blackjack",
  "chassis": "Blackjack",
  "model": "BJ-1DC",
  "mulId": 375,
  "config": "Biped",
  "techBase": "Inner Sphere",
  "era": 3024,
  "source": "TRO: 3039",
  "rulesLevel": 1,
  "role": "Brawler",
  "mass": 45,
  "engine": "180 Fusion Engine",
  "structure": "Standard",
  "myomer": "Standard",
  "heatSinks": "12 Single",
  "movement": {
    "walk": 4,
    "jump": 0
  },
  "armor": {
    "type": "Standard (InnerSphere)",
    "head": 9,
    "centerTorso": 18,
    "rightTorso": 15,
    "leftTorso": 15,
    "rightArm": 12,
    "leftArm": 12,
    "rightLeg": 17,
    "leftLeg": 17,
    "rearCenterTorso": 9,
    "rearRightTorso": 6,
    "rearLeftTorso": 6,
    "total": 136
  },
  "quirks": [
    "bad_rep_is"
  ],
  "weapons": [
    {
      "type": "Autocannon/2",
      "location": "LA"
    },
    {
      "type": "Autocannon/2",
      "location": "RA"
    },
    {
      "type": "Medium Laser",
      "location": "LA"
    },
    {
      "type": "Medium Laser",
      "location": "RA"
    },
    {
      "type": "Medium Laser",
      "location": "LT"
    },
    {
      "type": "Medium Laser",
      "location": "RT"
    },
    {
      "type": "Small Laser",
      "location": "RT"
    },
    {
      "type": "Small Laser",
      "location": "LT"
    }
  ],
  "locations": {
    "leftArm": [
      "Shoulder",
      "Upper Arm Actuator",
      "Medium Laser",
      "Autocannon/2",
      "Autocannon/2",
      "Medium Laser"
    ],
    "rightArm": [
      "Shoulder",
      "Upper Arm Actuator",
      "Medium Laser",
      "Autocannon/2",
      "Autocannon/2",
      "Medium Laser"
    ],
    "leftTorso": [
      "Medium Laser",
      "Small Laser",
      "Medium Laser",
      "Small Laser"
    ],
    "rightTorso": [
      "Medium Laser",
      "Small Laser",
      "Medium Laser",
      "Small Laser"
    ],
    "centerTorso": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Heat Sink",
      "IS Ammo AC/2"
    ],
    "head": [
      "Life Support",
      "Sensors",
      "Cockpit",
      "Sensors",
      "Life Support"
    ],
    "leftLeg": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Heat Sink",
      "Heat Sink"
    ],
    "rightLeg": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Heat Sink",
      "Heat Sink"
    ]
  },
  "text": {
    "overview": "The original contract between General Motors and the SLDF sought for \"a medium BattleMech with insurrection suppression and fire-support capabilities.\" The outcome was the Blackjack. Despite meeting all of its production requirements, the Blackjack gained an unjust reputation and was rejected by the Star League.",
    "capabilities": "The Blackjack's original mission was to assist in suppressing insurgent groups (mostly in the Periphery) that defied Star League authority in the decades preceding its demise. The Blackjack is only a minor success in its secondary capacity as a fire support platform. The autocannons lacked the firepower to take on heavily defended targets. At close range, though, the combination of lasers poses a significantly bigger threat. The addition of jump jets came late in the design phase, but the Whitworth Jetlift units have proven to be a vital asset over the decades. The Blackjack's sole significant disadvantage was negative press, which stated that the entire project was a shambles because the 'Mech's basic architecture was defective and unstable. The 'Mech's tiny footpads were alleged to cause falls and hamper maneuverability, or that the StarGuard II armor was brittle and tended to break off. Despite the fact that none of these accusations were ever proven, the Blackjack went out of favor, and few grieved the loss of GM's production line.",
    "deployment": "The 1DC Blackjack is another variant inspired by the Xhosa VII battle and was introduced a year after the similar 1DB. Rather than replace the arm-mounted weapons, the 1DC sacrifices the 'Mech's jumping ability in order to add two small lasers and an additional single heat sink to deal with the extra heat load.",
    "history": "The Blackjack had limited use in the Star League, and manufacture was shortly discontinued. Relegated to service with Hegemony planetary militia or sold to League member nations, it can still be encountered on the battlefield today. The majority of them now fight for the Capellan Confederation and the Federated Suns. The Confederation has nothing but disdain for the design. The breakaway St. Ives Compact, on the other hand, could not be as picky, and the Blackjack serves in the St. Ives Lancers. The Federated Suns used the Blackjack in the March Militias until the myth of the Blackjack's inferiority was busted on Xhosa VII in 3022. The Crucis Lancers and Deneb Light Cavalry were re-interested in the 'Mech."
  },
  "manufacturers": {
    "primary": [
      "General Motors (Refit)"
    ],
    "primaryFactory": [
      "Kathil"
    ],
    "systems": {
      "chassis": "GM BJ-1",
      "engine": "GM 180",
      "armor": "StarGuard II",
      "communications": "Dalban Micronics",
      "targeting": "Dalban AQ"
    }
  }
}