{
  "name": "Bombardier",
  "model": "BMB-14K",
  "tonnage": 65,
  "techBase": "Inner Sphere",
  "rulesLevel": "2",
  "engine": "325 XL Engine",
  "heatSinks": "10 Double",
  "movement": {
    "walk": "5",
    "jump": "0"
  },
  "armor": {
    "total": "Standard"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "Standard",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3050"
  ],
  "extras": {
    "mul id": "425",
    "Config": "Biped",
    "role": "Missile Boat",
    "quirk": "bad_rep_is",
    "Myomer": "Standard",
    "LA Armor": "20",
    "RA Armor": "20",
    "LT Armor": "22",
    "RT Armor": "22",
    "CT Armor": "29",
    "HD Armor": "9",
    "LL Armor": "30",
    "RL Armor": "30",
    "RTL Armor": "8",
    "RTR Armor": "8",
    "RTC Armor": "10",
    "Weapons": "5",
    "Overview": "Many 'Mechs were developed during the height of the Star League, created for the large and well-supplied formations of the SLDF. The Bombardier was no exception; employed as light artillery support, the onslaught of the Succession Wars destroyed its primary factories and left its manufacturer, Wakazashi Enterprises, without even the original plans for the design. With Wakazashi refusing to produce even spare parts for existing machines, the Bombardier began to steadily fall out of favor. Eventually it began to serve as little more than a mobile collection of spare parts, often dismantled to better service other designs such as the Archer.",
    "Capabilities": "With many variants built around twin LRM-20 launchers, what should have been a recipe for success instead inspired mediocrity. The LRMs only carried a ton of ammunition per launcher; while the SLDF and their massive logistical elements could easily resupply the BattleMech, the chaos of the Succession Wars were less than ideal for the Bombardier. The secondary weapons, both reliant upon ammunition themselves, lead to a BattleMech that heavily depended on a reliable logistical train and strong supporting elements. It comes to no surprise that most militaries and MechWarriors instead chose to ignore the Bombardier in favor of other missile support platforms.",
    "Deployment": "Never a common design, the remnants of the SLDF's Bombardier forces were scattered throughout all of the Great Houses and periphery states. The Free Worlds League and Draconis Combine fielded the highest concentration of BMB-10D's, though the mercantile FWL happily sold refurbished models to all willing parties. A variant made from older mothballed models, the -14K is a Kuritan take on the ancient design. Replacing the standard array with a large array of MMLs, machine guns, and a c3 Slave makes this variant a dangerous customer at every range.",
    "systemmanufacturer": "TARGETING:DLK",
    "systemmode": "TARGETING:Type Phased Array Sensors"
  },
  "era": "3071",
  "displayName": "Bombardier BMB-14K",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}