{
  "name": "Catapult",
  "chassis": "Catapult",
  "model": "CPLT-K2",
  "mulId": 487,
  "config": "Biped",
  "techBase": "Inner Sphere",
  "era": 2603,
  "source": "TRO: 3039",
  "rulesLevel": 1,
  "role": "Sniper",
  "mass": 65,
  "engine": "260 Fusion Engine",
  "structure": "Standard",
  "myomer": "Standard",
  "heatSinks": "20 Single",
  "movement": {
    "walk": 4,
    "jump": 0
  },
  "armor": {
    "type": "Standard (InnerSphere)",
    "head": 9,
    "centerTorso": 24,
    "rightTorso": 20,
    "leftTorso": 20,
    "rightArm": 18,
    "leftArm": 18,
    "rightLeg": 20,
    "leftLeg": 20,
    "rearCenterTorso": 11,
    "rearRightTorso": 8,
    "rearLeftTorso": 8,
    "total": 176
  },
  "quirks": [
    "no_arms",
    "weak_head_1"
  ],
  "weapons": [
    {
      "type": "PPC",
      "location": "LA"
    },
    {
      "type": "PPC",
      "location": "RA"
    },
    {
      "type": "Medium Laser",
      "location": "LT"
    },
    {
      "type": "Medium Laser",
      "location": "RT"
    },
    {
      "type": "Machine Gun",
      "location": "LT"
    },
    {
      "type": "Machine Gun",
      "location": "RT"
    }
  ],
  "locations": {
    "leftArm": [
      "Shoulder",
      "Upper Arm Actuator",
      "PPC",
      "PPC",
      "PPC",
      "PPC"
    ],
    "rightArm": [
      "Shoulder",
      "Upper Arm Actuator",
      "PPC",
      "PPC",
      "PPC",
      "PPC"
    ],
    "leftTorso": [
      "Heat Sink",
      "Heat Sink",
      "Medium Laser",
      "Machine Gun",
      "Medium Laser",
      "Machine Gun"
    ],
    "rightTorso": [
      "Heat Sink",
      "Heat Sink",
      "Heat Sink",
      "Medium Laser",
      "Machine Gun",
      "Medium Laser",
      "Machine Gun"
    ],
    "centerTorso": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Heat Sink",
      "IS Ammo MG - Full"
    ],
    "head": [
      "Life Support",
      "Sensors",
      "Cockpit",
      "Sensors",
      "Life Support"
    ],
    "leftLeg": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Heat Sink",
      "Heat Sink"
    ],
    "rightLeg": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Heat Sink",
      "Heat Sink"
    ]
  },
  "text": {
    "overview": "The Catapult, though a well-designed BattleMech, has had a tumultuous existence. Produced by Hollis Incorporated in record numbers for the SLDF, the Terran Hegemony ultimately decided to forgo contract renewal, leaving Hollis with a BattleMech line but no customer. When the facility was eventually retooled to produce the BattleMaster, they chose to completely abandon their Catapult chassis, and its numbers began to decline. The attrition of the Succession Wars left the Draconis Combine with many Catapults but no parts for them. Contracting Yori Mech Works, a production line was eventually built and new Catapults began entering the DCMS by 3033. The Capellan Confederation would follow suit and the Catapult would finally claim the popularity that it deserved.",
    "capabilities": "Carrying two LRM launchers in its \"ears\" and four medium lasers in its body, the Catapult was a fire support 'Mech akin to the slightly larger Archer. The inclusion of jump jets, though, and the placement of the lasers allowed many Catapults to be their own bodyguards. Many Catapult MechWarriors choose to fire all of their LRM missiles at their chosen targets before closing in to exploit any armor breaches with their lasers. This does make the Catapult slightly more flexible than many traditional support 'Mechs, although its limited ammunition stores can hamper it in extended ranged battles.",
    "deployment": "While visible in every military of note, the Capellan Confederation and Draconis Combine would lay claim to the lion's share of the design. When production for the Catapult began in both states, the divide only increased, with many states losing all of their examples of the design by the conclusion of the Jihad. A Kuritan innovation, the CPLT-K2 would replace both LRM \"ears\" with twin PPCs. This, combined with strengthened armor and twin machine guns, would turn the -K2 into a powerful line 'Mech suited to the Samurai mentality of many Combine MechWarriors. The formation of the Free Rasalhague Republic would see it enter service in the young state as well, though more advanced version of the -K2 would eventually lead to its disappearance.",
    "history": ""
  },
  "manufacturers": {
    "primary": [],
    "primaryFactory": [],
    "systems": {
      "chassis": "Hollis",
      "engine": "Magna",
      "armor": "Durallex",
      "communications": "O/P",
      "targeting": "O/P"
    }
  }
}