{
  "name": "Cauldron-Born",
  "model": "U",
  "tonnage": 65,
  "techBase": "Clan",
  "rulesLevel": "4",
  "engine": "325 XL (Clan) Engine(IS)",
  "heatSinks": "16 Double",
  "movement": {
    "walk": "5",
    "jump": "0"
  },
  "armor": {
    "total": "Ferro-Fibrous(Clan)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "Clan Endo Steel",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: Clan Invasion"
  ],
  "extras": {
    "clanname": "Ebon Jaguar",
    "mul id": "497",
    "Config": "Biped Omnimech",
    "role": "Sniper",
    "quirk": "low_profile",
    "Myomer": "Standard",
    "Base Chassis Heat Sinks": "13",
    "LA Armor": "17",
    "RA Armor": "17",
    "LT Armor": "22",
    "RT Armor": "22",
    "CT Armor": "32",
    "HD Armor": "9",
    "LL Armor": "19",
    "RL Armor": "19",
    "RTL Armor": "8",
    "RTR Armor": "8",
    "RTC Armor": "9",
    "Weapons": "6",
    "overview": "Introduced in 3049 to address flaws in the venerable Hellbringer, by Operation REVIVAL the Ebon Jaguar had only just started to spread through the Jaguar's touman with the Inner Sphere first encountering the design during the Battle of Luthien.",
    "capabilities": "Intended for use underwater, this variant carries five experimental UMUs. Each arm carries a single Large Pulse Laser and ER Small Laser to capitalize on armor breaches inflicted by the pair of LRT-15s carried in the torso.",
    "history": "Facing it for the first time when engaging the First Jaguar Guards Cluster in the Kado-Guchi Valley, the 'Mech's ability to take damage and remain operational led the Inner Sphere warriors who fought it to call it the Cauldron-Born after the unstoppable zombies of Irish myth. Paradoxically many of the other Clans also used the Inner Sphere Cauldron-Born reporting name, having first learned detailed information of the design from Inner Sphere sources. By Operation BULLDOG the Cauldron-Born made up a large proportion of the heavy 'Mechs of the rebuilding Smoke Jaguars, and following their Annihilation the design proliferated the remaining Clans, save the Jade Falcons, Wolves and Coyotes who continued to favor the Hellbringer. Following the Wars of Reaving the Ebon Jaguar had finally supplanted the Hellbringer in most Homeworld Clans, save the Coyotes who remained loyal to redeeming the honor of the design.",
    "manufacturer": "Huntress Manufacturing Plant DL-6",
    "primaryfactory": "Huntress",
    "systemmanufacturer": "TARGETING:Integrated Bravo-7"
  },
  "era": "3077",
  "displayName": "Cauldron-Born U",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}