{
  "name": "Dervish",
  "model": "DV-9D",
  "tonnage": 55,
  "techBase": "Inner Sphere",
  "rulesLevel": "2",
  "engine": "275 XL Engine",
  "heatSinks": "11 Double",
  "movement": {
    "walk": "5",
    "jump": "5"
  },
  "armor": {
    "total": "Standard"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "Endo Steel",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3050"
  ],
  "extras": {
    "mul id": "883",
    "Config": "Biped",
    "role": "Missile Boat",
    "quirk": "hyper_actuator",
    "Myomer": "Standard",
    "LA Armor": "18",
    "RA Armor": "18",
    "LT Armor": "20",
    "RT Armor": "20",
    "CT Armor": "26",
    "HD Armor": "9",
    "LL Armor": "26",
    "RL Armor": "26",
    "RTL Armor": "6",
    "RTR Armor": "6",
    "RTC Armor": "9",
    "Weapons": "4",
    "overview": "At the higher end of the medium class, the Dervish is a highly mobile fire support BattleMech. Commissioned in 2520 by the Lyran Commonwealth",
    "capabilities": "The Dervish has a maximum speed of 86.4 km/h, letting it keep up with and support most Succession Wars-era medium and light models. Five jump jets also gives the 'Mech a jumping capability of 150 meters, allowing it to move through rough terrain with ease; these were originally an afterthought in the design but have proven their worth. While regarded by some as a poor man's Archer, the Dervish's speed and weaponry nevertheless allow it to provide quick fire support and free larger 'Mechs for other duties. The design's major flaws lie in its lack of hand actuators and in its armoring. Having no hands limits its usefulness outside of combat and restricts its capability when confronted in close quarters. As for the armor, while sufficient to handle small and medium weapons, it is inadequate against heavier firepower. Commanders cannot overcome the first issue but they can affect the second, albeit at an apparent cost of firepower. The conundrum faced here is that the tradeoff becomes counterintuitive given the 'Mech's primary role in the field.",
    "deployment": "This upgrade of the -8D introduced in 3068 removes the missile launchers and replaces them with four MML-5s with five tons of ammunition to provide flexibility in the usage of munitions. The saved tonnage was used to add an additional double heat sink, though the heat management system can be quickly overtaxed at short range. 11.5 tons of armor improves the 'Mech's durability and a targeting computer was added to aid the accuracy of the lasers.",
    "history": "The Dervish was among the first 'Mechs mass produced by the Great Houses and has served as a workhorse for their armies since its introduction. It was eventually commissioned into the Star League Defense Force during the Reunification War, with the Terran Hegemony providing funds to allow their original model Dervishes be upgraded to the DV-6M standard in 2610. Its service in the SLDF ensured the widespread proliferation of the design; even ComStar Explorer Corps missions into the Deep Periphery have found examples of original-model Dervishes among the forces of Nueva Castile. Over the course of the Succession Wars however the 'Mech's numbers decreased due to loss or lack of parts, and all but one of Achernar's factories was destroyed. Though it could still be found throughout the Inner Sphere by the end of the Third Succession War, only the Federated Suns maintained production of the venerable design. The 'Mech remained one of the Suns' most common medium-weight machines, being particularly popular with the Avalon Hussars, and was earmarked for use by several newly forming Federated Commonwealth regiments after the Fourth Succession War. However, interest in the design began to wane in later years, and while the 7D refit of 3047 with its use of lostech generated higher sales, Achernar was forced to heavily lobby House Davion to keep buying them. Ironically the run-up to the FedCom Civil War and the conflict itself was enough to increase demand and prevent the company from retooling its Dervish lines. In the wake of the civil war the Federated Suns continued purchasing upgraded Dervishes while the Lyran Alliance adopted the Griffin. Older models can be found in militia and reserve units in other armies, while small mercenary outfits have found the 'Mech to be durable and easy to maintain. During the Jihad a number of manufacturers began manufacturing \"retrotech\" 'Mechs using details of the original production standard of primitive 'Mech designs; one of the designs that was reintroduced to service as a part of this retrotech manufacturing production was the original Dervish, with companies such as Sword of the Prophet Enterprises of Algedi producing primitive Dervishes; production at some sites continued beyond 3079.",
    "manufacturer": "Achernar Battlemechs",
    "primaryfactory": "New Avalon",
    "systemmanufacturer": "TARGETING:Federated Hunter Mk. II"
  },
  "era": "3068",
  "displayName": "Dervish DV-9D",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}