{
  "name": "Spider",
  "chassis": "Spider",
  "model": "SDR-8R",
  "mulId": 3018,
  "config": "Biped",
  "techBase": "Inner Sphere",
  "era": 3084,
  "source": "TRO: 3085",
  "rulesLevel": 2,
  "role": "Scout",
  "mass": 30,
  "engine": "210 Light Engine",
  "structure": "Endo Steel",
  "myomer": "Standard",
  "heatSinks": "10 Double",
  "movement": {
    "walk": 7,
    "jump": 10
  },
  "armor": {
    "type": "Standard (InnerSphere)",
    "head": 8,
    "centerTorso": 8,
    "rightTorso": 6,
    "leftTorso": 6,
    "rightArm": 5,
    "leftArm": 5,
    "rightLeg": 6,
    "leftLeg": 6,
    "rearCenterTorso": 2,
    "rearRightTorso": 2,
    "rearLeftTorso": 2,
    "total": 56
  },
  "quirks": [
    "easy_maintain",
    "nimble_jumper",
    "no_eject"
  ],
  "weapons": [
    {
      "type": "ER Medium Laser",
      "location": "CT"
    },
    {
      "type": "ER Medium Laser",
      "location": "CT"
    }
  ],
  "locations": {
    "leftArm": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Hand Actuator",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "Endo Steel",
      "Endo Steel",
      "Endo Steel",
      "Endo Steel",
      "Endo Steel"
    ],
    "rightArm": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Hand Actuator",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "Endo Steel",
      "Endo Steel",
      "Endo Steel",
      "Endo Steel",
      "Endo Steel"
    ],
    "leftTorso": [
      "Fusion Engine",
      "Fusion Engine",
      "Improved Jump Jet",
      "Improved Jump Jet",
      "Improved Jump Jet",
      "Improved Jump Jet",
      "Improved Jump Jet",
      "Improved Jump Jet",
      "Improved Jump Jet",
      "Improved Jump Jet",
      "Improved Jump Jet",
      "Improved Jump Jet"
    ],
    "rightTorso": [
      "Fusion Engine",
      "Fusion Engine",
      "Improved Jump Jet",
      "Improved Jump Jet",
      "Improved Jump Jet",
      "Improved Jump Jet",
      "Improved Jump Jet",
      "Improved Jump Jet",
      "Improved Jump Jet",
      "Improved Jump Jet",
      "Improved Jump Jet",
      "Improved Jump Jet"
    ],
    "centerTorso": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "ISERMediumLaser",
      "ISERMediumLaser",
      "ER Medium Laser",
      "ER Medium Laser"
    ],
    "head": [
      "Life Support",
      "Sensors",
      "Cockpit",
      "Sensors",
      "Life Support"
    ],
    "leftLeg": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Endo Steel",
      "Endo Steel"
    ],
    "rightLeg": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Endo Steel",
      "Endo Steel"
    ]
  },
  "text": {
    "overview": "The Spider was the first BattleMech produced by Newhart Industries, designed in 2650 as a light reconnaissance and attack 'Mech to be used by Star League Defense Force Special Operations forces such as the Blackhearts.",
    "capabilities": "In terms of maneuverability the Spider has a ground speed comparable to a Locust and can out-jump either the vaunted Wasp or Stinger light 'Mechs. Built with top-of-the-line reliable parts, sophisticated reconnaissance equipment and an energy weapon payload which allowed for extended operations without resupply, the Spider was a great success. While not produced in large numbers it could be rapidly manufactured and so served up through to the end of the Star League.",
    "deployment": "A post-Jihad variant produced by Krupp Armament Works for the Republic of the Sphere in 3084, the production model 8R was based on the prototype SDR-8X that used during the liberation of Terra. Built on an Endo Steel chassis and powered by a smaller 210 Light Fusion Engine - while its ground speed was reduced, the SDR-8R's ten Pitban LFT-20X Improved Jump Jets gave it amazing maneuverability. Carrying ten double heat sinks allowed the 8R to fire its twin Diverse Optics ER Medium Lasers and jump without fear of overheating. Boasting a very different look, the redesigned 8R was also notable for being one of the first Spiders to include an ejection system.",
    "history": "Beyond exceeding all of the SLDF's minimum requirements Newhart had actually designed the Spider before receiving the Star League's request for proposals and were ready to begin production immediately, factors which helped the company win the contract very quickly. Newhart's Spider factory on New Earth was destroyed in 2776 as part of the Amaris Civil War and very few Spiders ended up in the hands of the Successor States when the Star League dissolved. As their numbers began to dwindle during the Succession Wars, entire offensive operations were conducted simply to secure spare parts for these 'Mechs. So rare was the Spider that Wolf's Dragoons were notable for having an entire lance of Spiders (albeit split among the various regiments). This trend towards extinction was finally reversed when the Free Worlds League was able to secure the schematics for the Spider. In a deal with Nimakachi Fusion Products Limited, the company was given exclusive control of the 'Mech's technical specifications in exchange for building them for the Free Worlds League. Nimakachi began building new Spiders from their factory on Tematagi and later expanded their facilities on Lapida II to produce them as well, resulting in the Free Worlds League and Draconis Combine having the largest number of Spiders in active service. The recovery of lost Star League technology inspired Nimakachi to update the Spider with new upgrades, resulting in the improved SDR-7M and the derivative Venom. While the Free Worlds League did not express much interest in these 'Mechs, Nimakachi found ready buyers among the other Great Houses. In particular the Draconis Combine had lost a large number of light 'Mechs during the Clan Invasion and bought up local- and foreign-made Spiders to replenish their ranks. The Word of Blake also expressed an interest in these Spiders and bought a number to outfit their military. These Spiders were used as part of the Blakist conquest of Terra and were later gifted to the Protectorate Militia, where they fought in the Jihad. Starting in 3067, the Spider was restyled by Nimakachi which allowed the addition of an ejection system to the cockpit of the new SDR-7K, 7K2, and 7KC."
  },
  "manufacturers": {
    "primary": [
      "Krupp Armament Works"
    ],
    "primaryFactory": [
      "Terra"
    ],
    "systems": {
      "chassis": "Crucis-II Deluxe Endo Steel",
      "engine": "Pitban 210 Light Fusion Engine",
      "armor": "Kallon FWL Special Ferro-Fibrous",
      "jumpjet": "Pitban LFT-20X Improved Jump Jets",
      "communications": "Omicron 4002 Networking Channel",
      "targeting": "TRSS Eagle Eye"
    }
  }
}