{
  "name": "Thug",
  "chassis": "Thug",
  "model": "THG-11Eb",
  "mulId": 3206,
  "config": "Biped",
  "techBase": "Inner Sphere",
  "era": 2760,
  "source": "TRO: 3075",
  "rulesLevel": 2,
  "role": "Brawler",
  "mass": 80,
  "engine": "320 Fusion Engine",
  "structure": "Endo Steel",
  "myomer": "Standard",
  "heatSinks": "18 Double",
  "movement": {
    "walk": 4,
    "jump": 0
  },
  "armor": {
    "type": "Standard (InnerSphere)",
    "head": 9,
    "centerTorso": 34,
    "rightTorso": 25,
    "leftTorso": 25,
    "rightArm": 26,
    "leftArm": 26,
    "rightLeg": 34,
    "leftLeg": 34,
    "rearCenterTorso": 16,
    "rearRightTorso": 9,
    "rearLeftTorso": 9,
    "total": 247
  },
  "quirks": [
    "rugged_1"
  ],
  "weapons": [
    {
      "type": "ER PPC",
      "location": "LA"
    },
    {
      "type": "ER PPC",
      "location": "RA"
    },
    {
      "type": "SRM 6",
      "location": "LT"
    },
    {
      "type": "SRM 6",
      "location": "RT"
    }
  ],
  "locations": {
    "leftArm": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Hand Actuator",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISERPPC",
      "ISERPPC",
      "ISERPPC",
      "Endo Steel",
      "Endo Steel",
      "ER PPC"
    ],
    "rightArm": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Hand Actuator",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISERPPC",
      "ISERPPC",
      "ISERPPC",
      "Endo Steel",
      "Endo Steel",
      "ER PPC"
    ],
    "leftTorso": [
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "SRM 6",
      "SRM 6",
      "IS Ammo SRM-6",
      "ISCASE",
      "Endo Steel",
      "Endo Steel",
      "SRM 6"
    ],
    "rightTorso": [
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "SRM 6",
      "SRM 6",
      "IS Ammo SRM-6",
      "ISCASE",
      "Endo Steel",
      "Endo Steel",
      "SRM 6"
    ],
    "centerTorso": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Endo Steel"
    ],
    "head": [
      "Life Support",
      "Sensors",
      "Cockpit",
      "Endo Steel",
      "Sensors",
      "Life Support"
    ],
    "leftLeg": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Endo Steel",
      "Endo Steel"
    ],
    "rightLeg": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator",
      "Endo Steel",
      "Endo Steel"
    ]
  },
  "text": {
    "overview": "The Thug was designed by Maltex Corporation as a direct competitor to the popular Warhammer BattleMech. First seeing production in 2572.",
    "capabilities": "The armament on the Thug is a very simple, yet effective, combination. For striking power, it carries two Tiegart Particle Projector Cannons in either arm, similar in performance to those found on the Warhammer yet ten percent smaller and more redundant. Backing up the PPCs are two Bical-6 SRM launchers mounted in either side torso with one ton of CASE-protected reloads. These allow the 'Mech to fight off enemies which get within the minimum range of its PPCs and use special dilating covers when not in use. Eighteen double heat sinks gives the Thug a far superior heat dissipation compared to the Warhammer while a ten-ton heavier Endo Steel frame allows it to carry fifteen and a half tons of armor, more than half again as much carried by the Warhammer. The Thug also benefits from the fact that it has hand actuators, making it a mean close-quarters combatant and a good raider able to carry away the spoils of its labor. The 11Eb is an upgrade of the Thug used by the SLDF Royal Brigades in 2760. It upgrades the PPCs to ER PPCs.",
    "deployment": "",
    "history": "The Thug sought to directly address some of the challenges which faced the Warhammer, chief of which was to increase armor protection without sacrificing firepower. When compared side-by-side, the Thug has a great many advantages over the Warhammer, yet it never wholly replaced the venerable 'Mech. Still the Thug proved popular enough that Maltex Corporation was forced to contract Earthwerks Incorporated to produce the Thug on Keystone in order to meet demand. Although it has had its detractors, the Thug has proven itself for over five hundred years to be the quintessential \"zombie 'Mech.\" Production of the Thug from Maltex's original factory on Errai ceased when it was destroyed in 2835, one of many causalities of the Succession Wars, leaving only Earthwerks to continue building new Thugs at a rate of twelve per year. Unfortunately the same terrible conflict resulted in the loss of much advanced knowledge and technology, threatening their ability to keep even this meager production rate up. In a twist of fate it was the Warhammer which helped keep the Thug production line alive: with the loss of their original PPC weaponry, Earthwerks instead reworked the design to make use of the extensive stockpile of Donal PPCs used by the Warhammer, allowing new Thugs to be built and repairs to be made more easily. Beyond the few still in service to the Great Houses the largest user of Thugs was ComStar, a fact confirmed upon the reveal of their Com Guards. Eventually the recovery of lostech would allow both Earthwerks and Maltex to restart production of original-model Thugs during the 3050s. These were supplanted by new variants which, following the formation of the Second Star League, were supplied to ComStar, the SLDF, the Draconis Combine and Federated Suns. New Thugs were also built for the Word of Blake and those forces of the Free Worlds League aligned with them during the Jihad."
  },
  "manufacturers": {
    "primary": [
      "Maltex Corporation",
      "Earthwerks Incorporated"
    ],
    "primaryFactory": [
      "Errai",
      "Keystone"
    ],
    "systems": {
      "chassis": "Earthwerks VOL Endo Steel",
      "engine": "Pitban 320",
      "armor": "Mitchell Argon with CASE",
      "communications": "Colmax 90",
      "targeting": "TharHes Ares-5"
    }
  }
}