{
  "name": "Turkina",
  "model": "U",
  "tonnage": 95,
  "techBase": "Clan",
  "rulesLevel": "4",
  "engine": "285 XL (Clan) Engine(IS)",
  "heatSinks": "15 Clan Double",
  "movement": {
    "walk": "3",
    "jump": "3"
  },
  "armor": {
    "total": "Standard(Clan)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "IS Standard",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: Clan Invasion"
  ],
  "extras": {
    "mul id": "3333",
    "Config": "Biped Omnimech",
    "role": "Juggernaut",
    "quirk": "easy_pilot",
    "myomer": "Standard",
    "base chassis heat sinks": "11",
    "LA armor": "32",
    "RA armor": "32",
    "LT armor": "30",
    "RT armor": "30",
    "CT armor": "45",
    "HD armor": "9",
    "LL armor": "40",
    "RL armor": "40",
    "RTL armor": "10",
    "RTR armor": "10",
    "RTC armor": "10",
    "Weapons": "13",
    "Liquid Storage (OMNIPOD)": "SIZE:1.0 (ARMORED)",
    "overview": "The Turkina is a powerful OmniMech that was first seen in the Turkina Keshik at the Battle of Tukayyid, and entered general service with Clan Jade Falcon following the end of the Refusal War. In a design oddity, the Turkina mounts enough jump jets to vault 90 meters hardwired onto the frame, rather than using them in modular pods. While this simplified repair, it also uses tonnage that could be devoted to other systems when a mission does not call for jumping. Designers also included fifteen double heat sinks, four more than could be fit into the engine, so they are fixed in the torso. The Turkina has 42 tons available for modular pods.",
    "capabilities": "Designed for space operations, this Turkina configuration mounts several experimental systems. A BattleMech HarJel System protects the torso against breaches, and two Liquid Storage tanks provide additional fuel for the jump jets. A Coolant Pod can quickly dissipate the heat built up by the ten ER Small Lasers, twin LRM-15s, and ATM-9. An Active Probe allows the Turkina U to find enemy forces, and the Talons mounted in each leg prevent the Turkina from floating away from the hull. To provide additional protection the Liquid Storage tanks, Harjel systems, and Coolant Pod have all been armored against enemy fire.",
    "history": "The Turkina is named after Turkina, the first Jade Falcon to be tamed, who inspired the leaders of Clan Jade Falcon in its early days. The name of the Turkina Keshik is also derived from this bird.",
    "manufacturer": "Complex Beta, Olivetti Weapons",
    "primaryfactory": "Ironhold, Sudeten",
    "systemmanufacturer": "TARGETING:Series JFIX/Olivetti Pinpoint Advanced"
  },
  "era": "3077",
  "displayName": "Turkina U",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}