{
  "name": "Uller",
  "model": "I",
  "tonnage": 30,
  "techBase": "Clan",
  "rulesLevel": "3",
  "engine": "180 XL (Clan) Engine(IS)",
  "heatSinks": "10 Double",
  "movement": {
    "walk": "6",
    "jump": "0"
  },
  "armor": {
    "total": "Ferro-Fibrous(Clan)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "Clan Endo Steel",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "Record Sheets: 3145 New Tech New Upgrades"
  ],
  "extras": {
    "clanname": "Kit Fox",
    "mul id": "6932",
    "Config": "Biped Omnimech",
    "role": "Brawler",
    "quirk": "low_profile",
    "Myomer": "Standard",
    "Base Chassis Heat Sinks": "7",
    "LA Armor": "7",
    "RA Armor": "7",
    "LT Armor": "8",
    "RT Armor": "8",
    "CT Armor": "9",
    "HD Armor": "9",
    "LL Armor": "8",
    "RL Armor": "8",
    "RTL Armor": "4",
    "RTR Armor": "4",
    "RTC Armor": "4",
    "Weapons": "3",
    "overview": "The Kit Fox is a light Clan OmniMech with long-range combat as a primary focus, earning it the Inner Sphere codename of Uller, after the Norse god of archery.",
    "capabilities": "Often fielded by Clan Jade Falcon, the Kit Fox has a surprising amount of firepower, with the ten built-in double heat sinks sometimes barely able to fully cool the 'Mech down. However, the Kit Fox is somewhat slow for its weight class, only capable of a top speed of 97.2 km/h, provided by a lightweight 180 XL Fusion Engine. Available tonnage is further increased by the use of a lightweight Endo Steel chassis. Four tons of Ferro-Fibrous armor provide the Kit Fox with ample protection.",
    "deployment": "The I configuration is equipped with an ER PPC, ER Small Laser, and ER Medium Laser, all of which are tied into a Targeting Computer. The arms, legs, and front of the side torsos are protected by Modular Armor. The I configuration is equipped with an engine Supercharger, which allows it to reach speeds of slightly more than 100km/h for brief instances.",
    "history": "The Kit Fox was another light OmniMech designed by Clan Cloud Cobra, and was first produced in 2890 with the aid of new resources coming from the Tanite Worlds. Rather than emphasize speed, the Kit Fox emphasizes armor and firepower, complementary to the role of the Fire Moth. Clan Jade Falcon Khan Bret Malthus took note of the new design after a string of Cloud Cobra victories, and issued a batchall to the Cobras, a challenge the Jade Falcons only very narrowly won. Clan Snow Raven also produces the Kit Fox, which they acquired by trade. All other Clans field the Kit Fox as isorla, except Clan Blood Spirit, who was gifted the Kit Fox by the generous (or Machiavellian?) Ravens.",
    "manufacturer": "Babylon MechWorks V (Cloud Cobra),Production Line Gamma 2 (Snow Raven),Ironhold Plant 9 (Jade Falcon),Snow Raven Industrial Complex Beta",
    "primaryfactory": "Babylon, Lum, Ironhold, Mitchella",
    "systemmanufacturer": "TARGETING:Series XXX MultiTrack"
  },
  "era": "3101",
  "displayName": "Uller I",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}