{
  "name": "Vanquisher",
  "model": "VQR-7U",
  "tonnage": 100,
  "techBase": "Inner Sphere",
  "rulesLevel": "3",
  "engine": "300 Compact Fusion Engine",
  "heatSinks": "16 Double",
  "movement": {
    "walk": "3",
    "jump": "0"
  },
  "armor": {
    "total": "Standard Armor"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "Endo-Steel",
  "cockpit": "Small Cockpit",
  "gyro": "Compact Gyro",
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "Record Sheets: 3067 Unabridged"
  ],
  "extras": {
    "mul id": "5721",
    "Config": "Biped",
    "role": "Juggernaut",
    "quirk": "no_arms",
    "Myomer": "Triple Strength Myomer",
    "LA Armor": "34",
    "RA Armor": "34",
    "LT Armor": "32",
    "RT Armor": "32",
    "CT Armor": "45",
    "HD Armor": "9",
    "LL Armor": "42",
    "RL Armor": "42",
    "RTL Armor": "10",
    "RTR Armor": "10",
    "RTC Armor": "14",
    "Weapons": "11",
    "overview": "Based on the King Crab, and built in the same factory that first produced the Mackie, the Vanquisher has a legendary pedigree.",
    "capabilities": "In order to allow it to carry as heavy a payload as possible without sacrificing durability, the 'Mech is built on a Hollis Alteration Mark VI Endo Steel that carries a Vlar 300 fusion engine, which propels the 'Mech to a top speed of 54 km/h. The Vanquisher is protected by nineteen and a half tons of armor with CASE in both side torsos to protect the 'Mech from going down in an ammunition explosion.",
    "deployment": "This Vanquisher variant uses a Compact Engine and Compact Gyro to improve survivability. The MechWarrior piloting it is forced into a Small Cockpit, which allows the head to carry a Heavy Flamer and fuel. Each arm carries a Plasma Rifle and ER Flamer, which are backed up by a Snub Nose PPC and two Small VSP Lasers. A Beagle Active Probe allows the 7U to find hidden enemy units, and a Remote Sensor Dispenser is also fitted. This variant also carries sixteen double heat sinks to dissipate the heat generated by the weapons, but it is also equipped with Triple Strength Myomer to turn a liability (excess heat) into a strength.",
    "history": "The Vanquisher has its genesis in the development of reverse engineered Improved C3 Computers. Once the Word of Blake had perfected their version of C3i, Cameron St. Jamais contacted Skobel MechWorks and contracted them to produce a 'Mech that would showcase the features of the new system. The Vanquisher was the result of that request.",
    "manufacturer": "Skobel MechWorks",
    "primaryfactory": "Russia, Terra",
    "systemmanufacturer": "TARGETING:Falcon 12b Watcher"
  },
  "era": "3071",
  "displayName": "Vanquisher VQR-7U",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}