{
  "name": "Wraith",
  "model": "TR1",
  "tonnage": 55,
  "techBase": "Inner Sphere",
  "rulesLevel": "2",
  "engine": "385 XL Engine(IS)",
  "heatSinks": "10 IS Double",
  "movement": {
    "walk": "7",
    "jump": "7"
  },
  "armor": {
    "total": "Ferro-Fibrous(Inner Sphere)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "IS Endo Steel",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3055"
  ],
  "extras": {
    "mul id": "3588",
    "Config": "Biped",
    "role": "Skirmisher",
    "quirk": "difficult_maintain",
    "myomer": "Standard",
    "LA armor": "14",
    "RA armor": "14",
    "LT armor": "18",
    "RT armor": "18",
    "CT armor": "23",
    "HD armor": "8",
    "LL armor": "20",
    "RL armor": "20",
    "RTL armor": "5",
    "RTR armor": "5",
    "RTC armor": "7",
    "Weapons": "3",
    "overview": "The Wraith is a 'Mech that, when properly employed, can wreak havoc on an enemy with its astounding speed and maneuverability.",
    "capabilities": "It is built around a massive LTV 385 XL engine that allows it to reach speeds of just under 119 km/h. The 'Mech is also fitted with seven CurtissJet 55 jump jets which allow it to jump up to two hundred and ten meters, giving it the ability to outmaneuver most BattleMechs in existence, and also allowing the Wraith to quickly traverse any rough terrain. The 'Mech's speed, firepower, and decent armor make the Wraith a considerable threat to many 'Mechs – some being almost twice its weight.",
    "deployment": "The Wraith has a simple, yet effective, weapons payload. The 'Mech is armed with a Tronel XIII Large Pulse Laser that provides the majority of its firepower. Backing this up is a pair of Tronel XII Medium Pulse Lasers that provide firepower for close-in work. This pulse laser weaponry allows the 'Mech to negate most of the side effects on accuracy that are introduced by the Wraith's heavy use of jump jets, making it incredibly accurate and powerful for such a lightly armed 'Mech",
    "history": "The Wraith marked Curtiss Militech's entry into BattleMech production. When the design was announced, many felt that the design would be little more than a walking water cooler. What the critics got was a shock. Following the destruction of its sole factory, Curtiss Hydroponics announced its withdrawal from the military market altogether and the sale of its Curtiss Militech assets. By 3085, Hellespont Industrials have expressed interest in the Wraith; and by 3145 Production had been ongoing at one of Hellespont Industrials locations in the Sian Commonality for Capellan use.",
    "manufacturer": "Curtiss Militech, Hellespont 'Mech Works",
    "primaryfactory": "Paradise, Sian",
    "systemmanufacturer": "TARGETING:Dynatec 2780"
  },
  "era": "3055",
  "displayName": "Wraith TR1",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}