{
  "name": "Zeus-X",
  "model": "ZEU-X4",
  "tonnage": 80,
  "techBase": "Inner Sphere",
  "rulesLevel": "4",
  "engine": "400 XXL Engine(IS)",
  "heatSinks": "11 Double",
  "movement": {
    "walk": "5",
    "jump": "0"
  },
  "armor": {
    "total": "Reactive(Inner Sphere)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "IS Composite",
  "cockpit": "Command Console",
  "gyro": "Standard Gyro",
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3145 Lyran Commonwealth"
  ],
  "extras": {
    "mul id": "6630",
    "Config": "Biped",
    "role": "Sniper",
    "quirk": "difficult_maintain",
    "Myomer": "Standard",
    "LA Armor": "23",
    "RA Armor": "23",
    "LT Armor": "26",
    "RT Armor": "26",
    "CT Armor": "37",
    "HD Armor": "9",
    "LL Armor": "30",
    "RL Armor": "30",
    "RTL Armor": "8",
    "RTR Armor": "8",
    "RTC Armor": "12",
    "Weapons": "4",
    "overview": "The original ZEU-X was a technological milestone. It was also an unwieldy mess of patchwork armor, reactive composites, and illogical short-range weapons, the limited manufacturing of which during the Civil War functioned only as propaganda. The following model was a massive failure, as the marriage of armored components and composite structure frequently ended in a pile of intact internal components as the only remains of a defeated ZEU-X2. A 3080s model was an inefficient jumping monster informed by Solaris research on the enigmatic Sasquatch. Only the sub-variant ZEU-WD series, which combined X-series improvements with conventional Zeus chassis, was a success.",
    "capabilities": "Manufactured on by Defiance, the Zeus X was both a poster child for excellence in production engineering and an innovative high-technology platform, while at the same time struggling with emerging technologies.",
    "deployment": "The Zeus X mounted a Corean Light Gauss Rifle with a ton of ammunition in the left arm, and a Doombud LRM-20 Launcher in the right arm, fed by two tons of ammunition stored in the right torso. A Defiance Model 6 Extended Range Large Laser was mounted in the left torso and a Defiance X5M Medium X-Pulse Laser in the center torso.",
    "history": "The Zeus personifies Steiner's \"wall of steel.\" The LCAF's indigenous pride and joy was reportedly the ultimate demonstration that superior production quality could compensate for weak battlefield prowess. It was picked for a facelift after three centuries of steadfast service to demonstrate Defiance's reputation as one of the Inner Sphere's major manufacturers. The Zeus X is equal parts celebrity and cutting-edge high-tech platform. Its modifications bring the ancient BattleMech up to date, even by thirty-second-century standards. The Zeus X-series is characterised structurally by a massive engine and a light yet brittle structure coated in layers of experimental armor. These qualities were carefully integrated with appropriate equipment when the ZEU-X4 was ready for manufacturing in the late 3110. The thick reactive plating is now production quality and completely covers the 'Mech. The LCAF received a command 'Mech when a roomy rumble seat was upgraded to a full console. Armed with modest but effective weapons, the ZEU-X4 attacks foes who are nothing more than approaching blots on the horizon. end of the Third Succession War, with the resulting ZEU-6T variant being the standard during the Fourth Succession War and later the War of 3039. The design was also well received by mercenary units, particularly the Zeta Battalion of Wolf's Dragoons.",
    "manufacturer": "Defiance Manufacturing Annex",
    "primaryfactory": "Kwangjong-ni",
    "systemmanufacturer": "TARGETING:TharHes Ares-X9-B"
  },
  "era": "3119",
  "displayName": "Zeus-X ZEU-X4",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}