{
  "name": "Zeus",
  "chassis": "Zeus",
  "model": "ZEU-5S",
  "mulId": 3640,
  "config": "Biped",
  "techBase": "Inner Sphere",
  "era": 2788,
  "source": "TRO: 3039",
  "rulesLevel": 2,
  "role": "Sniper",
  "mass": 80,
  "engine": "320 Fusion Engine(IS)",
  "structure": "IS Standard",
  "myomer": "Standard",
  "heatSinks": "14 IS Double",
  "movement": {
    "walk": 4,
    "jump": 0
  },
  "armor": {
    "type": "Standard (InnerSphere)",
    "head": 9,
    "centerTorso": 26,
    "rightTorso": 18,
    "leftTorso": 18,
    "rightArm": 22,
    "leftArm": 22,
    "rightLeg": 24,
    "leftLeg": 24,
    "rearCenterTorso": 9,
    "rearRightTorso": 6,
    "rearLeftTorso": 6,
    "total": 184
  },
  "quirks": [
    "barrel_fists_ra",
    "easy_maintain"
  ],
  "weapons": [
    {
      "type": "Ultra AC/5",
      "location": "LA"
    },
    {
      "type": "LRM 15",
      "location": "RA"
    },
    {
      "type": "ER Large Laser",
      "location": "LT"
    },
    {
      "type": "Medium Laser",
      "location": "LT"
    },
    {
      "type": "Medium Laser",
      "location": "CT"
    }
  ],
  "locations": {
    "leftArm": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "ISUltraAC5",
      "ISUltraAC5",
      "ISUltraAC5",
      "ISUltraAC5",
      "ISUltraAC5",
      "IS Ultra AC/5 Ammo",
      "IS Ultra AC/5 Ammo",
      "Ultra AC/5"
    ],
    "rightArm": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "LRM 15",
      "LRM 15",
      "LRM 15",
      "ISArtemisIV",
      "LRM 15"
    ],
    "leftTorso": [
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISERLargeLaser",
      "ISERLargeLaser",
      "Medium Laser (R)",
      "ER Large Laser",
      "Medium Laser"
    ],
    "rightTorso": [
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "ISDoubleHeatSink",
      "IS Ammo LRM-15 Artemis-capable"
    ],
    "centerTorso": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Medium Laser",
      "Medium Laser"
    ],
    "head": [
      "Life Support",
      "Sensors",
      "Cockpit",
      "Sensors",
      "Life Support"
    ],
    "leftLeg": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator"
    ],
    "rightLeg": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator"
    ]
  },
  "text": {
    "overview": "The Zeus was first built by the Lyran Commonwealth in 2787, just as the First Succession War began. Built at the request of Lyran Commonwealth Armed Forces commanders for a new light-assault 'Mech designed to engage the enemy at long range and perform hit-and-run attacks.",
    "capabilities": "The Zeus is fast enough to keep up with most heavy 'Mechs, and with a sturdy frame, eleven and a half tons of standard armor and a versatile weapons array, is equally capable of defeating them. Its use of reliable, low-maintenance and easily modified systems at a time when most 'Mechs were built with cutting-edge technology also proved fortuitous, allowing the Zeus to be produced long after those advanced components had become Lostech.",
    "deployment": "One of the two original models of the Zeus, it was equipped with an Ultra AC/5 with two tons of ammunition, the LRM-15 was linked to an Artemis IV FCS, and the large laser was an extended range model. Fourteen double heat sinks kept the entire machine cool.",
    "history": "Three years before its release, the first two prototypes of the Zeus would have their first \"test run\" when they were forced to repel an attack on the Hesperus II factory by the Draconis Combine Mustered Soldiery. As the enemy pushed through Lyran lines, the two 'Mechs were summoned to aid, and through sheer novelty and long-range firepower, the Kuritans were forced to pause. This enabled more reinforcements to push back DCMS forces. While these prototypes were effective in repelling the attack, they were considerably more advanced than the commercial model and armed with a PPC, which proved unpredictable and unreliable during the combat. Inadequate shielding caused wild magnetic interactions between the weapon and the Zeus' engine, which was later revealed to be the source of this behavior. To guarantee that the Zeus arrived at the front lines as soon as possible, the complex energy weapon was replaced with a basic autocannon. The 'Mech initially appeared in substantial numbers after the 15th Lyran Guards regained the planet Sakhalin, and the Zeus had a long and storied history within the Commonwealth during the Succession Wars, becoming a well-respected assault 'Mech. Engineers were able to put a PPC on the Zeus again after the end of the Third Succession War, with the resulting ZEU-6T variant being the standard during the Fourth Succession War and later the War of 3039. The design was also well received by mercenary units, particularly the Zeta Battalion of Wolf's Dragoons."
  },
  "manufacturers": {
    "primary": [
      "Defiance Industries"
    ],
    "primaryFactory": [
      "Hesperus II"
    ],
    "systems": {
      "chassis": "Chariot Type III",
      "engine": "Pitban 320",
      "armor": "Valiant Lamellor",
      "communications": "TharHes Calliope ZE-2",
      "targeting": "TharHes Ares-7"
    }
  }
}