{
  "name": "Avalanche",
  "model": "AVL-1O",
  "tonnage": 50,
  "techBase": "Inner Sphere",
  "rulesLevel": "2",
  "engine": "250 Fusion Engine(IS)",
  "heatSinks": "10 IS Double",
  "movement": {
    "walk": "5",
    "jump": "5"
  },
  "armor": {
    "total": "Standard(Inner Sphere)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "IS Endo Steel",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3145 Draconis Combine"
  ],
  "extras": {
    "mul id": "6396",
    "Config": "Biped Omnimech",
    "role": "Missile Boat",
    "quirk": "bad_rep_is",
    "myomer": "Standard",
    "base chassis heat sinks": "10",
    "LA armor": "15",
    "RA armor": "15",
    "LT armor": "17",
    "RT armor": "17",
    "CT armor": "24",
    "HD armor": "8",
    "LL armor": "21",
    "RL armor": "21",
    "RTL armor": "7",
    "RTR armor": "7",
    "RTC armor": "8",
    "Weapons": "6",
    "overview": "The Avalanche is a thirty-second century medium OmniMech, first deployed by the Draconis Combine and Clan Nova Cat.",
    "capabilities": "Constructed using Inner Sphere technologies, the 'Mech design was envisioned with economics in mind. The Avalanche is powered by a 250-rated fusion engine, giving it a modest maximum speed of 86 km/h, while its hull is protected by 10 tons of standard armor, which gives it less armor protection than other designs of the time. Mobility is enhanced with five jump jets, and CASE mounted in its right torso protects against complete destruction from a magazine detonation. Additional equipment and weapons are allotted 16 tons of pod space, giving decent flexibility.",
    "deployment": "The Avalanche gains its name from its primary configuration which consists of two LRM-10 launchers in its torso, which obscure it in a white, snow-like cloud of smoke when firing. These are backed up with a quartet of ER medium lasers mounted in the arms.",
    "history": "The 'Mech was conceived as part of a joint project between House Kurita and its then ally Clan Nova Cat, and served as part of an effort to aid in the rebuilding the Clan's depleted touman as a result of the aftermath of the 2nd Combine-Dominion War that ended in 3101. The 'Mech would be developed over the next 30 years, however development would prove to be challenging for both groups. After decades of development, the Avalanche would still have a number of design flaws which would give it a bad reputation among warriors of Clan Nova Cat. The 'Mech would soon be deployed shortly before House Kurita's invasion of the Republic of the Sphere, where it would serve among House Kurita's elite forces. After the destruction of Clan Nova Cat, as a result of its revolt against Coordinator Yori Kurita, the dead Clan's allotment of Avalanches would be sold off to other Inner Sphere powers.",
    "manufacturer": "Luthien Armor Works",
    "primaryfactory": "Luthien",
    "systemmanufacturer": "TARGETING:Matabushi Stalker"
  },
  "era": "3133",
  "displayName": "Avalanche AVL-1O",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}