{
  "name": "Bandersnatch",
  "model": "BNDR-01A",
  "tonnage": 75,
  "techBase": "Inner Sphere",
  "rulesLevel": "2",
  "engine": "300 XL Engine",
  "heatSinks": "10 Double",
  "movement": {
    "walk": "4",
    "jump": "0"
  },
  "armor": {
    "total": "Standard(Inner Sphere)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "Standard",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3055"
  ],
  "extras": {
    "mul id": "217",
    "Config": "Biped",
    "role": "Brawler",
    "quirk": "ubiquitous_is",
    "Myomer": "Standard",
    "LA Armor": "18",
    "RA Armor": "18",
    "LT Armor": "23",
    "RT Armor": "23",
    "CT Armor": "23",
    "HD Armor": "9",
    "LL Armor": "18",
    "RL Armor": "18",
    "RTL Armor": "8",
    "RTR Armor": "8",
    "RTC Armor": "10",
    "Weapons": "11",
    "overview": "The Bandersnatch, who receives his name from the monster mentioned in Lewis Carroll's \"Wonderland\" series, is the brainchild of Felifious Bander and is built around the concept of an affordable and effective BattleMech for sale to mercenary units.",
    "capabilities": "The Bandersnatch is built using some common components with the Marauder in an attempt to make the 'Mech cheaper and easier to repair. The 'Mech has a top speed of 64.8 kph which is average for a 'Mech of its weight. The Bandersnatch also uses double heat sinks for their superior heat dissipation capabilities, allowing a heavy weapons payload to be used by the 'Mech. Finally, the Bandersnatch carries a respectable eleven tons of armor. While not the maximum amount of armor that the chassis can handle, the 'Mech is still well protected.",
    "deployment": "The Bandersnatch is primarily armed for long to medium range combat. The first weapons that it would bring to bear on an enemy are a trio of Holly LRM-5 missile launchers, which can lay down a powerful barrage of missiles. The next weapons that the Bandersnatch can employ are a pair of Armstrong Class-B ClusterGuns LB-X Autocannon/10s that fire both solid and cluster rounds. These are effective against a variety of targets and make the Bandersnatch capable of anti-aircraft duties. Finally, in the event that an enemy does close to short ranges, the 'Mech carries six Magna Mk II Medium Lasers, two of which are rear mounted, giving it good close range protection.",
    "manufacturer": "Bander BattleMechs, Kressly WarWorks",
    "primaryfactory": "Terra Firma (Bander BattleMechs), Epsilon Eridani (Kressly WarWorks)",
    "systemmanufacturer": "TARGETING:Winston Sidewinder"
  },
  "era": "3052",
  "displayName": "Bandersnatch BNDR-01A",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}