{
  "name": "Barghest",
  "model": "BGS-1T",
  "tonnage": 70,
  "techBase": "Inner Sphere",
  "rulesLevel": "2",
  "engine": "350 XL Engine(IS)",
  "heatSinks": "10 IS Double",
  "movement": {
    "walk": "5",
    "jump": "0"
  },
  "armor": {
    "total": "Standard(Inner Sphere)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "IS Standard",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3060"
  ],
  "extras": {
    "mul id": "252",
    "Config": "Quad",
    "role": "Sniper",
    "quirk": "directional_torso_mount",
    "myomer": "Standard",
    "FLL armor": "27",
    "FRL armor": "27",
    "LT armor": "21",
    "RT armor": "21",
    "CT armor": "30",
    "HD armor": "9",
    "RLL armor": "26",
    "RRL armor": "26",
    "RTL armor": "6",
    "RTR armor": "6",
    "RTC armor": "9",
    "Weapons": "3",
    "overview": "During her reign over the Lyran Alliance, Katherine Steiner-Davion decided she wanted a four-legged BattleMech that would frighten its adversaries in the same way that the classic Atlas and Banshee designs did.",
    "capabilities": "The Earthwerk GRF Quad chassis accommodates a Magna 350 XL engine, which saves weight and lets the 'Mech to carry a hefty weapons payload. The Barghest is shielded by thirteen tons of Durallex Heavy armor, which shields it from all but the most powerful enemy fire. The Barghest features ten double heat sinks to handle the 'Mech's heat buildup from its weaponry.",
    "deployment": "The Barghest carries two BlazeFire Sweetshot ER Large Lasers that allow the 'Mech to hit a target at up to five hundred and seventy meters. For medium to close range combat, the Barghest carries a powerful Defiance Disintegrator LB-X Autocannon/20 that is capable of firing both standard ammunition and cluster rounds that act like 'Mech-sized shotgun shells. The 'Mech's simplicity is also a weakness, as the Barghest has only the two ER Large Lasers if the autocannon falls silent from a lack of ammunition or a jam.",
    "history": "Katrina Steiner, Archon of the Lyran Alliance, created this novel and distinctive design. The Archon notified Tharkad's TharHes Industries that she desired to build a new design with a horrific appearance, similar to that of the Atlas or the Banshee. She also desired a four-legged design. TharHes executives tried unsuccessfully to persuade her to abandon the quad design, which has been heavily criticized for decades. TharHes Industries only realized the political and military consequences of a new quad design in the Lyran Alliance Armed Forces during the final testing of the new 'Mech, when new four-legged designs debuted in the Draconis Combine and Free Worlds League militaries. The Archon dubbed the finished 'Mech Barghest after the fierce, wolf-like monsters of folklore, after seeing its animalistic elegance and power.",
    "manufacturer": "TharHes Industries",
    "primaryfactory": "Tharkad",
    "systemmanufacturer": "TARGETING:TharHes Ares-8a"
  },
  "era": "3058",
  "displayName": "Barghest BGS-1T",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}