{
  "name": "Dasher",
  "model": "C",
  "tonnage": 20,
  "techBase": "Clan",
  "rulesLevel": "2",
  "engine": "200 XL (Clan) Engine(IS)",
  "heatSinks": "10 Double",
  "movement": {
    "walk": "10",
    "jump": "0"
  },
  "armor": {
    "total": "Ferro-Fibrous(Clan)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "Clan Endo Steel",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3050"
  ],
  "extras": {
    "clanname": "Fire Moth",
    "mul id": "840",
    "Config": "Biped Omnimech",
    "role": "Missile Boat",
    "quirk": "overhead_arms",
    "Myomer": "Standard",
    "Base Chassis Heat Sinks": "8",
    "LA Armor": "3",
    "RA Armor": "3",
    "LT Armor": "4",
    "RT Armor": "4",
    "CT Armor": "5",
    "HD Armor": "5",
    "LL Armor": "4",
    "RL Armor": "4",
    "RTL Armor": "2",
    "RTR Armor": "2",
    "RTC Armor": "2",
    "Weapons": "3",
    "overview": "The Fire Moth is a light Clan OmniMech intended for scouting and infantry support and transport, often deployed by Clan Ghost Bear.",
    "capabilities": "The Fire Moth is easily one of the quickest designs ever produced, with a running speed of 162.0 km/h and accelerating up to 216.0 km/h with the MASC system fitted on the 'Mech's chassis, which is why the Inner Sphere assigned it the codename Dasher. The Fire Moth's higher speed stems from its 200-rated extralight fusion engine, which is typical of many light 'Mechs in its liberal use of lightweight materials. An endo steel chassis saves space, as does two tons of ferro-fibrous armor; this meager amount of armor serves as the only barrier between an attacker and the 'Mech's fragile internals, and as a result, the Fire Moth relies on speed rather than durability for survival. The 'Mech's heat is easily dissipated by the conventional 10 double heat sinks.",
    "deployment": "An attempt to use the design for indirect fire support, the Fire Moth C mounted dual LRM-5 missile racks, as well as an anti-missile system, to prevent any retribution by its target.",
    "history": "The Fire Moth was originally designed by Clan Cloud Cobra scientists as an infantry support OmniMech. The high-placed arms were positioned in order for a pair of infantry \"pods\" underslung on the arms of the prototype Fire Moth. Designed to ease transporting Elementals into battle, the \"pods\" were discarded after the first field test, but the arms were never adjusted when the OmniMech debuted in 2874. Clan Ghost Bear came into possession of the Fire Moth when Clan Cloud Cobra traded the design for five years of trade considerations. Both the Ghost Bears and Clan Hell's Horses make extensive use of the Fire Moth for reconnaissance, dueling, and infantry support. Because the Fire Moth is poorly armed and armored, and infantry support is a lack-luster assignment, the Fire Moth is frequently assigned to warriors who are older and lack bloodnames before they reach solahma units. These warriors tend to be extremely aggressive. Most of the Fire Moth factories were moved to the Inner Sphere after Operation Revival. Though the 'Mech is rare in Clan Space, it is commonly passed over in favor of the Phantom OmniMech by the remaining Home Clans, as it fulfills the same roles of the Fire Moth but with heavier armor.",
    "manufacturer": "Dominion Facility Kappa-4 and -5",
    "primaryfactory": "Goito, Thule",
    "systemmanufacturer": "TARGETING:Hakkøn MicroSystems"
  },
  "era": "2874",
  "displayName": "Dasher C",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}