{
  "name": "Mongoose II",
  "model": "MON-267",
  "tonnage": 40,
  "techBase": "Inner Sphere",
  "rulesLevel": "2",
  "engine": "320 XL Engine",
  "heatSinks": "10 Double",
  "movement": {
    "walk": "8",
    "jump": "0"
  },
  "armor": {
    "total": "Stealth"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "Endo Steel",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3075"
  ],
  "extras": {
    "mul id": "2217",
    "Config": "Biped",
    "role": "Scout",
    "quirk": "imp_com",
    "Myomer": "Standard",
    "LA Armor": "9",
    "RA Armor": "9",
    "LT Armor": "11",
    "RT Armor": "11",
    "CT Armor": "14",
    "HD Armor": "8",
    "LL Armor": "15",
    "RL Armor": "15",
    "RTL Armor": "4",
    "RTR Armor": "4",
    "RTC Armor": "4",
    "Weapons": "1",
    "overview": "Luthien Armor Works was working on an upgrade of the Mongoose for ComStar to be a faster and tougher scout 'Mech, when the chaos on Luthien during the early years of the Jihad forced them to look elsewhere.",
    "capabilities": "The result is the Mongoose II, an effective hunter-killer that is able to find hidden enemies and provide long range fire support. Equipped with an impressive suite of electronics, the 'Mech carries a Beagle Active Probe, Guardian ECM Suite, C3i Computer, and MASC that enables it move up to 172 km/h in bursts. A respectable seven tons of armor protects the Mongoose II.",
    "deployment": "This variant is built using a C3 Slave Unit so that it can integrate with the C3 systems in use by the Lyran Alliance. Six and a half tons of Stealth Armor use the ECM Suite to make the 267 a difficult target at range, taking advantage of the long range weapon. A Targeting Computer makes the laser even more accurate.",
    "history": "ComStar financed a refit of a lost Rim Worlds Republic factory on Kwangjong-ni. New versions of the Zeus and Banshee were walking off the line for battlefield testing when Word of Blake conquered Hesperus II. Anxious to stay solvent, ComStar C-bills paid for the upgrade to the Kwangjong-ni facility. In exchange, Defiance sold them sixty-six percent of its production for its first two years.",
    "manufacturer": "Arc-Royal MechWorks, Defiance Manufacturing Annex",
    "primaryfactory": "Arc-Royal,Kwangjong-ni",
    "systemmanufacturer": "TARGETING:Nashan Trac V-102 with Active Probe"
  },
  "era": "3073",
  "displayName": "Mongoose II MON-267",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}