{
  "name": "Raijin II",
  "model": "RJN-200-C",
  "tonnage": 50,
  "techBase": "Inner Sphere",
  "rulesLevel": "2",
  "engine": "300 Light Engine",
  "heatSinks": "10 Double",
  "movement": {
    "walk": "6",
    "jump": "6"
  },
  "armor": {
    "total": "Stealth(Inner Sphere)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "Endo Steel",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3055"
  ],
  "extras": {
    "mul id": "2630",
    "Config": "Biped",
    "role": "Skirmisher",
    "quirk": "bad_rep_is",
    "Myomer": "Triple-Strength",
    "LA Armor": "16",
    "RA Armor": "16",
    "LT Armor": "18",
    "RT Armor": "18",
    "CT Armor": "24",
    "HD Armor": "9",
    "LL Armor": "24",
    "RL Armor": "24",
    "RTL Armor": "6",
    "RTR Armor": "6",
    "RTC Armor": "8",
    "Weapons": "3",
    "overview": "The Raijin is designed to be highly mobile and capable of engaging an enemy at a variety of ranges.",
    "capabilities": "The 'Mech's relatively light armor can be a liability if it is engaged in close combat or finds itself in a protracted engagement.",
    "deployment": "The 200-C takes the concept of the 101-A and the 200-B and combines the best of them making an agile, long-range sniper 'Mech that is extremely hard to hit. This is done by combining the light fusion engine, Stealth Armor and ECM suite of the 200-B model with the armament and Triple Strength Myomer of the 200-A model. The 200-C is armed with an ER PPC for long range combat which is backed up by two ER Medium Lasers. The 'Mech is also linked to an improved C3 network, making it one of the most impressive sniper 'Mechs. However, it should be noted that its stealth armor interferes with the C3 network while active, requiring the pilot to choose between improved accuracy or stealth.",
    "history": "The Raijin was designed after the Battle of Tukayyid to rearm ComGuard units that had suffered losses in the campaign. Despite having stockpiled Star League-era BattleMechs at his disposal, Precentor Martial Focht wanted something unfamiliar to both the Inner Sphere and the Clans. The Raijin was redesigned after Word of Blake forces lost considerable amounts of the design during its taking of Terra from ComStar in 3058. Newly redesigned Raijin II units began to be deployed in 3066, with older versions of the 'Mech being refitted to RJN-200-A variant standards. While off-shoots of the 200-A were deployed to elite Divisions.",
    "manufacturer": "Martinson Armaments,Martinson Armaments",
    "primaryfactory": "Caph,Terra",
    "systemmanufacturer": "TARGETING:Garret T12A"
  },
  "era": "3066",
  "displayName": "Raijin II RJN-200-C",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}