{
  "name": "Templar III",
  "model": "TLR2-O",
  "tonnage": 85,
  "techBase": "Inner Sphere",
  "rulesLevel": "2",
  "engine": "340 Light Engine(IS)",
  "heatSinks": "17 IS Double",
  "movement": {
    "walk": "4",
    "jump": "0"
  },
  "armor": {
    "total": "Standard(Inner Sphere)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "IS Endo Steel",
  "cockpit": "Standard Cockpit",
  "gyro": "Heavy Duty Gyro",
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3145 Federated Suns"
  ],
  "extras": {
    "mul id": "6353",
    "Config": "Biped Omnimech",
    "role": "Brawler",
    "myomer": "Standard",
    "base chassis heat sinks": "13",
    "LA armor": "28",
    "RA armor": "28",
    "LT armor": "26",
    "RT armor": "26",
    "CT armor": "44",
    "HD armor": "9",
    "LL armor": "36",
    "RL armor": "36",
    "RTL armor": "10",
    "RTR armor": "10",
    "RTC armor": "10",
    "Weapons": "7",
    "overview": "The Templar III is a Dark Age era Assault Class OmniMech, first produced by General Motors for the Federated Suns. It was intended as a replacement for the original Templar, whose factory lines were destroyed during the Jihad. General Motors established a new production line on New Valencia for what was to become the next generation of the Templar with newer technologies.",
    "capabilities": "Like its predecessor, the Templar III is typically utilized as a Command 'Mech by AFFS forces. With its alternate configurations the 'Mech is able to handle various combat situations thanks to access to Advanced equipment.",
    "deployment": "The Prime Configuration of the Templar III is not unlike the older WHM-8D Warhammer's weapons load-out. The Configuration is armed with that older design's ER PPCs, Extended-Ranged Medium and Small Lasers, while having a single 4-Tubed Short-Range Missile Launcher instead of the 6-Tubed Launcher. All of its energy weapons are tied together with a Targeting Computer and cooled down by four additional Double Heat Sinks. The launcher ammunition is protected by the Templar III",
    "history": "Among the most noticeable differences when comparing the original Templar to the Templar III is its smaller Pod Capacity. The new 'Mech has a 29 ton Pod capacity in comparison to the old Templar's 40 tons. However, the 'Mech's heavier Light Engine provides improved durability while retaining the original design's maximum speed and armor protection.",
    "manufacturer": "General Motors",
    "primaryfactory": "New Valencia",
    "systemmanufacturer": "TARGETING:Spar 3C MegaTrak"
  },
  "era": "3100",
  "displayName": "Templar III TLR2-O",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}