{
  "name": "Thor",
  "model": "A",
  "tonnage": 70,
  "techBase": "Clan",
  "rulesLevel": "2",
  "engine": "350 XL (Clan) Engine(IS)",
  "heatSinks": "14 Double",
  "movement": {
    "walk": "5",
    "jump": "5"
  },
  "armor": {
    "total": "Ferro-Fibrous(Clan)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "IS Standard",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: Clan Invasion"
  ],
  "extras": {
    "clanname": "Summoner",
    "mul id": "3174",
    "Config": "Biped Omnimech",
    "role": "Sniper",
    "quirk": "ubiquitous_clan",
    "Myomer": "Standard",
    "Base Chassis Heat Sinks": "14",
    "LA Armor": "17",
    "RA Armor": "17",
    "LT Armor": "22",
    "RT Armor": "22",
    "CT Armor": "27",
    "HD Armor": "9",
    "LL Armor": "23",
    "RL Armor": "23",
    "RTL Armor": "7",
    "RTR Armor": "7",
    "RTC Armor": "8",
    "Weapons": "3",
    "overview": "The Summoner is a highly mobile heavy OmniMech with a mix of speed, mobility, armor, and firepower. Making it a highly effective and reliable mech commonly used by Clan Jade Falcon in a wide variety of roles.",
    "capabilities": "The Summoner is powered by a lightweight 350 XL engine that gives the 'Mech a top speed of 86.4 km/h. The mobility of the Summoner is enhanced with five jump jets that allow it to jump up to one hundred and fifty meters. The Summoner has fourteen double heat sinks which are capable of handling the heat produced in most of the 'Mechs configurations with ease. To protect it from damage, the Summoner carries nine and a half tons of Ferro-Fibrous armor.",
    "deployment": "For long range combat, the Summoner A has a powerful Gauss Rifle which is supported by a Large Pulse Laser for intermediate ranges and an SRM-6 launcher for close combat.",
    "history": "Barely a second generation OmniMech, the Jade Falcons introduced the Summoner just after becoming the first Clan to win OmniMech technology from Clan Coyote in 2863. The Summoner was dubbed Thor, its Inner Sphere reporting name, by Victor Steiner-Davion himself after fighting one on Trellwan. The name was supposedly inspired by the weapons loadout (in Prime configuration): a PPC and an AC, lightning and thunder, which are associated with the Norse god Thor. Largely supplanted within the Jade Falcons by its successor the Grand Summoner during the Dark Age era, Clan Hell's Horses maintained production of the original on Svarstaad, ensuring by 3150 the Summoner was the oldest continuously produced OmniMech.",
    "manufacturer": "Eagle Craft Group, St. Louis MechWorks, Svarstaad Industriplex Gamma",
    "primaryfactory": "Ironhold, Niles, Svarstaad",
    "systemmanufacturer": "TARGETING:Hawkeye 58"
  },
  "era": "2872",
  "displayName": "Thor A",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}