{
  "name": "Toro",
  "model": "TR-A-6",
  "tonnage": 35,
  "techBase": "Inner Sphere",
  "rulesLevel": "1",
  "engine": "175 Fusion Engine",
  "heatSinks": "10 Single",
  "movement": {
    "walk": "5",
    "jump": "0"
  },
  "armor": {
    "total": "Standard(Inner Sphere)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "Standard",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3075"
  ],
  "extras": {
    "mul id": "3277",
    "Config": "Biped",
    "role": "Missile Boat",
    "quirk": "cramped_cockpit",
    "Myomer": "Standard",
    "LA Armor": "10",
    "RA Armor": "10",
    "LT Armor": "11",
    "RT Armor": "11",
    "CT Armor": "14",
    "HD Armor": "9",
    "LL Armor": "14",
    "RL Armor": "14",
    "RTL Armor": "3",
    "RTR Armor": "3",
    "RTC Armor": "5",
    "Weapons": "3",
    "overview": "The Toro was the Taurian Concordat's first indigenous BattleMech. First produced in 2481, the design was based on captured Firebees and developed as a collaboration between the three best arms manufacturers in the Concordat.",
    "capabilities": "The light 'Mech is slow by 31st century standards, but it was quite maneuverable for the Age of War. The design topped out at 86 km/h. It was protected by a respectable six and a half tons of armor. Its comparatively low cost allowed entire battalions to swiftly be equipped with BattleMechs",
    "deployment": "The Toro was a long-range fighter. It was armed with a Taurus WarWorks PPC and two Delta Dart LRM-5 launchers. The standard allotment of heat sinks was sufficient as long as the MechWarrior managed his or her heat wisely. Two tons of ammunition kept the Toro in protracted engagements and allowed flexibility in ammo selection. Due to the lack of short-range backup, Toros were arrayed in staggered lines so as to allow them to support each other.",
    "history": "The Toro took to the front lines against the Star League in the Reunification War, but was not enough to stop the combined might of the Inner Sphere. The League shut down and demolished all of the Toro factories by 2598 in the hope that it would crush Taurian nationalism, though there is no evidence it had the desired effect. Under the Star League aegis, the Taurian heavy industry produced League 'Mechs, a situation they pragmatically continued with following its fall. Thanks to the dissemination of the Hegemony Memory Core during the Jihad the Toro was finally revived by manufacturers in the Concordat, Calderon Protectorate, Magistracy of Canopus and ironically the Federated Suns.",
    "manufacturer": "Taurus WarWorks",
    "primaryfactory": "Taurus (discontinued 2598)",
    "systemmanufacturer": "TARGETING:VeraTech MechTnT XVT20S"
  },
  "era": "2548",
  "displayName": "Toro TR-A-6",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}