{
  "name": "Vulture",
  "model": "D",
  "tonnage": 60,
  "techBase": "Clan",
  "rulesLevel": "2",
  "engine": "300 XL (Clan) Engine(IS)",
  "heatSinks": "13 Double",
  "movement": {
    "walk": "5",
    "jump": "0"
  },
  "armor": {
    "total": "Ferro-Fibrous(Clan)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "IS Standard",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3050"
  ],
  "extras": {
    "clanname": "Mad Dog",
    "mul id": "3469",
    "Config": "Biped Omnimech",
    "role": "Skirmisher",
    "quirk": "imp_target_med",
    "Myomer": "Standard",
    "Base Chassis Heat Sinks": "12",
    "LA Armor": "16",
    "RA Armor": "16",
    "LT Armor": "16",
    "RT Armor": "16",
    "CT Armor": "23",
    "HD Armor": "9",
    "LL Armor": "23",
    "RL Armor": "23",
    "RTL Armor": "7",
    "RTR Armor": "7",
    "RTC Armor": "7",
    "Weapons": "8",
    "overview": "The Mad Dog is a heavy Clan OmniMech used for long-range indirect fire support. With hunched shoulders, a protruding head, and reverse-jointed legs, the Mad Dog resembles a vulture, so much so that it was codenamed Vulture and Hagetaka (\"Vulture\" in Japanese) by the Inner Sphere forces which first encountered it.",
    "capabilities": "This variant uses a pair of ATM 12s that are powerful at all ranges. It also uses paired ER Medium Lasers, Medium Pulse Lasers, and ER Small Lasers. An extra heat sink helps to keep heat levels under some control.",
    "deployment": "The name also fit the battlefield role of the Mad Dog; to act as a support 'Mech, and it often holds a hill maintaining constant watch over the entire battlefield, like a vulture waiting for its prey. With its ample firepower and decent speed of 86.4 km/h, it makes a highly mobile firing platform, and as such has spread to near ubiquity among the forces deployed by the Clans, although the design is favored more by Clan Ghost Bear MechWarriors. The Mad Dog carries eight and a half tons of Ferro-Fibrous armor for decent protection, although it will not be able to stand up to heavy fire.",
    "history": "The Mad Dog was designed by Clan Smoke Jaguar as a second generation OmniMech based on the original heavy OmniMech Lupus of Clan Coyote. The Mad Dog also used some of the same moulds of the Clan Wolf Timber Wolf OmniMech. However, despite using some of the same moulds (which might be viewed as high praise), the Mad Dog was named as a slur to the Lupus and Timber Wolf, and to Clans Wolf and Coyote. Because of its widespread production, most Clans maintain a large number of Mad Dogs in their toumans.",
    "manufacturer": "Various,Svarstaad Industriplex Beta",
    "primaryfactory": "Various,Svarstaad",
    "systemmanufacturer": "TARGETING:Cat’s Eye MD6"
  },
  "era": "3054",
  "displayName": "Vulture D",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}