{
  "name": "Wolverine",
  "model": "WVR-9M",
  "tonnage": 55,
  "techBase": "Inner Sphere",
  "rulesLevel": "2",
  "engine": "275 XL Engine(IS)",
  "heatSinks": "15 Double",
  "movement": {
    "walk": "5",
    "jump": "5"
  },
  "armor": {
    "total": "Standard(Inner Sphere)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "Standard",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3085"
  ],
  "extras": {
    "mul id": "3582",
    "Config": "Biped",
    "role": "Skirmisher",
    "quirk": "cramped_cockpit",
    "weaponquirk": "jettison_capable:RA:7:Heavy PPC",
    "Myomer": "Standard",
    "LA Armor": "16",
    "RA Armor": "16",
    "LT Armor": "20",
    "RT Armor": "20",
    "CT Armor": "27",
    "HD Armor": "9",
    "LL Armor": "24",
    "RL Armor": "24",
    "RTL Armor": "6",
    "RTR Armor": "6",
    "RTC Armor": "8",
    "Weapons": "3",
    "overview": "The Wolverine commonly served as a heavy scout unit. Often deployed in situations where heavy opposition could easily destroy lighter BattleMechs, it has had a reliable service record ever since its initial deployment within the Star League Defense Force. With respectable armor, speed, and firepower, it can easily outfight lighter enemy scouts and defend itself capably if ambushed.",
    "capabilities": "The autocannon, missile system and laser found on most Wolverines are all reliable and well-storied systems. Unfortunately, the jump jets suffer from an opposing reputation; the Northrup 12000's are underpowered and prone to breakdowns. The one defining system to be found on the Wolverine, however, are its superb Tek BattleCom and Garret T11-b communications systems. The comgear, regardless of the manufacturer, is well-shielded and features a multi-channel transmitter and receiver, making the Wolverine a powerful Command BattleMech for scouting formations.",
    "deployment": "The Wolverine 9M introduced in 3073 is powered by a Nissan XL Engine that allows the 'Mech to move at speeds of up to 86.4 km/h while sacrificing durability. The 9M can also jump up to one hundred and fifty meters, as with most other variants. The 9M is armed with a Fusigon Strongtooth Heavy PPC as its primary weapon, which has a similar damage profile to a Clan ER PPC, but at reduced ranges. This is backed up by a Diverse Optics ER medium laser and a Guided Technologies Second Generation Streak SRM-6 launcher for close combat.",
    "history": "A widespread part of every major military, the Wolverine has manufacturing plants scattered throughout the entire Inner Sphere. While certain states-notably the Free Worlds League-have larger numbers of the design, only the Capellans began facing a shortage of the Wolverine after the loss of their Nanking facilities.",
    "manufacturer": "Kallon Weapon Industries",
    "primaryfactory": "Thermopolis",
    "systemmanufacturer": "TARGETING:Cat Eyes 5"
  },
  "era": "3073",
  "displayName": "Wolverine WVR-9M",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}