{
  "name": "Wraith",
  "model": "TR3",
  "tonnage": 55,
  "techBase": "Inner Sphere",
  "rulesLevel": "2",
  "engine": "385 XL Engine",
  "heatSinks": "10 Double",
  "movement": {
    "walk": "7",
    "jump": "6"
  },
  "armor": {
    "total": "Ferro-Fibrous(Inner Sphere)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "Endo Steel",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3055"
  ],
  "extras": {
    "mul id": "3591",
    "Config": "Biped",
    "role": "Skirmisher",
    "quirk": "difficult_maintain",
    "Myomer": "Standard",
    "LA Armor": "14",
    "RA Armor": "14",
    "LT Armor": "18",
    "RT Armor": "18",
    "CT Armor": "23",
    "HD Armor": "8",
    "LL Armor": "20",
    "RL Armor": "20",
    "RTL Armor": "5",
    "RTR Armor": "5",
    "RTC Armor": "7",
    "Weapons": "3",
    "overview": "The Wraith is a 'Mech that, when properly employed, can wreak havoc on an enemy with its astounding speed and maneuverability.",
    "capabilities": "It is built around a massive LTV 385 XL engine that allows it to reach speeds of just under 119 km/h. The 'Mech is also fitted with seven CurtissJet 55 jump jets which allow it to jump up to two hundred and ten meters, giving it the ability to outmaneuver most BattleMechs in existence, and also allowing the Wraith to quickly traverse any rough terrain. The 'Mech's speed, firepower, and decent armor make the Wraith a considerable threat to many 'Mechs – some being almost twice its weight.",
    "deployment": "A modification of the Wraith made by the Word of Blake, the TR3 replaces the two Medium Pulse Lasers with two ER Medium Lasers while one of the jump jets is removed to make room for an improved C3 computer, making the Wraith an incredibly powerful point 'Mech for units equipped with C3i equipment.",
    "history": "The Wraith marked Curtiss Militech's entry into BattleMech production. When the design was announced, many felt that the design would be little more than a walking water cooler. What the critics got was a shock. Following the destruction of its sole factory, Curtiss Hydroponics announced its withdrawal from the military market altogether and the sale of its Curtiss Militech assets. By 3085, Hellespont Industrials have expressed interest in the Wraith; and by 3145 Production had been ongoing at one of Hellespont Industrials locations in the Sian Commonality for Capellan use.",
    "manufacturer": "Refit",
    "primaryfactory": "Refit",
    "systemmanufacturer": "TARGETING:Dynatec 2780"
  },
  "era": "3065",
  "displayName": "Wraith TR3",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}