{
  "name": "Goliath",
  "model": "GOL-5W",
  "tonnage": 80,
  "techBase": "Inner Sphere",
  "rulesLevel": "2",
  "engine": "320 Fusion Engine(IS)",
  "heatSinks": "15 Double",
  "movement": {
    "walk": "4",
    "jump": "0"
  },
  "armor": {
    "total": "Stealth(Inner Sphere)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "Standard",
  "cockpit": "Small Cockpit",
  "gyro": "Standard Gyro",
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3085"
  ],
  "extras": {
    "mul id": "1236",
    "Config": "Quad",
    "role": "Brawler",
    "quirk": "exp_actuator",
    "Myomer": "Standard",
    "FLL Armor": "34",
    "FRL Armor": "34",
    "LT Armor": "26",
    "RT Armor": "26",
    "CT Armor": "38",
    "HD Armor": "9",
    "RLL Armor": "34",
    "RRL Armor": "34",
    "RTL Armor": "8",
    "RTR Armor": "8",
    "RTC Armor": "12",
    "Weapons": "5",
    "overview": "The Goliath is used as a general assault 'Mech and until recently was not usually seen in large numbers because of the bias against quad 'Mechs prior to the 3060s.",
    "capabilities": "The Goliath is armed with what would be considered a paltry armament for a 'Mech of its size.",
    "deployment": "The 5W variant of the Goliath is armed with two Ceres Arms Crusher Plasma Rifles which not only inflict damage on their targets but heat as well. The 5W is also armed with three Medium Lasers for close combat. The 'Mech has a Guardian ECM Suite which is needed to properly use its sixteen and a half tons of Stealth Armor. Additionally, the 'Mech has a Small Cockpit that is cramped and makes the 'Mech harder to pilot but saves valuable weight. The 'Mech also has an Improved C3 computer, allowing it to share targeting telemetry with similarly equipped units.",
    "history": "The Goliath is the second 'Mech built in 2652 by Brigadier Corporation. The Goliath is based on lessons that were learned from the Scorpion. The first and most important difference is that the Goliath weighs in at 80 tons allowing it to carry a much heavier weapons payload and armor at the cost of mobility. In the late 3060s the Goliath saw renewed production and renewed popularity and has since become a powerful and respected assault 'Mech. In 3143, The Corean Enterprises - MacAdams-Suharno plant on Stewart was captured by Clan Wolf, and it's GOL-6M variant production line converted to produce a Clan version of the 'Mech.",
    "manufacturer": "Refit",
    "primaryfactory": "Hall",
    "systemmanufacturer": "TARGETING:Corean B-Tech"
  },
  "era": "3071",
  "displayName": "Goliath GOL-5W",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}