{
  "name": "Hellhound",
  "model": "3",
  "tonnage": 50,
  "techBase": "Clan",
  "rulesLevel": "2",
  "engine": "300 Fusion (Clan) Engine",
  "heatSinks": "13 Double",
  "movement": {
    "walk": "6",
    "jump": "6"
  },
  "armor": {
    "total": "Ferro-Fibrous(Clan)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "Endo Steel",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3055"
  ],
  "extras": {
    "clanname": "Conjurer",
    "mul id": "1475",
    "Config": "Biped",
    "role": "Skirmisher",
    "quirk": "ext_twist",
    "Myomer": "Standard",
    "LA Armor": "14",
    "RA Armor": "14",
    "LT Armor": "19",
    "RT Armor": "19",
    "CT Armor": "23",
    "HD Armor": "9",
    "LL Armor": "24",
    "RL Armor": "24",
    "RTL Armor": "5",
    "RTR Armor": "5",
    "RTC Armor": "7",
    "Weapons": "3",
    "overview": "The Conjurer (code-named the Hellhound by the Inner Sphere nations) is a fast, inexpensive medium BattleMech that excels at medium to short range.",
    "capabilities": "Starting as befitting its status as a second-line 'Mech, most Conjurers uses a standard engine, though it is constructed on an endo steel chassis and uses eight and a half tons of ferro-fibrous armor. Its jump jets enable it to leap up to 180 meters at a time. However Clan Nova Cat’s Conjurer program in the 3060s saw refits and various new builds at times only loosely based on the original. It is noteworthy that the Conjurer is, for all intents and purposes, the Wolverine IIC and was even reported as such by ComStar in early sightings, presumably for its obvious heritage; it was designed off the WVR-7H Wolverine II variant of the original Wolverine, taking the concept and rebuilding it with advanced technology in the fashion of a IIC rebuild. However the Clans would not retain the name of the Not-Named Clan for the redesigned 'Mech.",
    "deployment": "The third variation is based on the original, it mounts an ER large laser and a pair of heavy medium lasers. Three additional double heat sinks keep heat in check, while a targeting computer aids the accuracy of all three weapons.",
    "history": "Even with an established infrastructure, rebuilding a destroyed Touman for any Clan is a hard task. Rebuilding was a Herculean effort for the Nova Cats, whose infrastructure could barely maintain current units in the field operating, let alone replace units destroyed during the Ghost Bear-Combine battle. The Nova Cats' ongoing reliance on the Draconis Combine may not be sustainable. It harmed their self-esteem and threatened to demoralize them in the long run. If Khan Santin West and his Nova Cats were to survive as a Clan, they would have to conquer this hurdle. Nova Cat scientists, technicians, and Galaxy Commanders looked for a different way to restore their depleted Touman. They updated existing BattleMechs instead of replacing the massive number of lost OmniMechs. The Hellhound was the first such candidate because of its proven battle record and the implications of its moniker. Everyone agreed that retooling this 'Mech would help to shore up the Nova Cats' tattered forces. The Hellhound's performance profile needed to be refined to satisfy new Nova Cat warfare doctrines, which meant the Cats needed assistance from their longtime friend and ally, Clan Diamond Shark. Through the Chatterweb, Khan West contacted Shark Khan Barbara Sennet and offered three Carrack Merchant-class warships and the rights to the new Hellhound in exchange for all of the materials and components needed to create it. Khan West has asked assistance in restoring the Cats' infrastructure, including the construction of new factories on Irece and Avon. The Diamond Sharks enthusiastically agreed to the deal.",
    "manufacturer": "Irece Alpha",
    "primaryfactory": "Irece",
    "systemmanufacturer": "TARGETING:Build 4 CAT Advanced TTS"
  },
  "era": "3064",
  "displayName": "Hellhound 3",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}