{
  "name": "Hermes",
  "chassis": "Hermes",
  "model": "HER-1A",
  "mulId": 1485,
  "config": "Biped",
  "techBase": "Inner Sphere",
  "era": 2856,
  "source": "TRO: 3039",
  "rulesLevel": 1,
  "role": "Scout",
  "mass": 30,
  "engine": "270 Fusion Engine",
  "structure": "Standard",
  "myomer": "Standard",
  "heatSinks": "10 Single",
  "movement": {
    "walk": 9,
    "jump": 0
  },
  "armor": {
    "type": "Standard (InnerSphere)",
    "head": 7,
    "centerTorso": 7,
    "rightTorso": 6,
    "leftTorso": 6,
    "rightArm": 5,
    "leftArm": 5,
    "rightLeg": 6,
    "leftLeg": 6,
    "rearCenterTorso": 4,
    "rearRightTorso": 2,
    "rearLeftTorso": 2,
    "total": 56
  },
  "quirks": [
    "imp_com",
    "stable"
  ],
  "weapons": [
    {
      "type": "Medium Laser",
      "location": "CT"
    },
    {
      "type": "Medium Laser",
      "location": "RA"
    },
    {
      "type": "Flamer",
      "location": "LA"
    }
  ],
  "locations": {
    "leftArm": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Flamer",
      "Flamer"
    ],
    "rightArm": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "Hand Actuator",
      "Medium Laser",
      "Medium Laser"
    ],
    "centerTorso": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Medium Laser",
      "Medium Laser"
    ],
    "head": [
      "Life Support",
      "Sensors",
      "Cockpit",
      "Sensors",
      "Life Support"
    ],
    "leftLeg": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator"
    ],
    "rightLeg": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator"
    ]
  },
  "text": {
    "overview": "The Star League, showing its industrial and economic might, commissioned a new dedicated scout in 2632. Irian BattleMechs Unlimited won the contract, and was able to fulfill initial orders for this new Hermes quicker then anticipated. This caused concern in the SLDF's Quartermaster Command despite the 'Mech apparently meeting all requirements. These suspicions were quickly confirmed, as many 'Mechs in the initial run had unresolved issues with their electronics that made their targeting systems all but useless. While these problems were eventually rectified, the time needed for the fix was not insignificant, and the 'Mech would develop a negative reputation that would follow it during the remainder of the Star League era.",
    "capabilities": "Emphasizing mobility over firepower, the Hermes was faster than nearly every 'Mech in service at the time of its introduction. Once the glitches surrounding the targeting systems were fixed, the Alexis Photon proved popular with technicians as it reduced wear and tear on the laser systems. The initial production variant used a fuel-based flamer instead of the more modern version that would tap directly into a 'Mech's fusion plant. Considered to be quite safe, MechWarriors piloting Hermes could even choose to jettison the fuel storage cylinders if needed.",
    "deployment": "The Hermes only served in the SLDF for 19 years, after which they were put in storage or relegated to militia commands. The Succession Wars forced the Hermes back into frontline regiments through sheer need, though Irian chose to re-engineer the 'Mech in the heavier Hermes II instead of putting the base chassis back into production. Instead, Irian would refit existing Hermes chassises into the downgraded HER-1A variant as the Succession Wars spurred technological decline. Only seeing service in the Free Worlds League military, the variant would rapidly vanish after the rediscovery of advanced technology in the Helm Core.",
    "history": ""
  },
  "manufacturers": {
    "primary": [],
    "primaryFactory": [],
    "systems": {
      "chassis": "Irian Chassis",
      "engine": "GM",
      "armor": "Starshield",
      "communications": "Irian",
      "targeting": "Wasat"
    }
  }
}