{
  "name": "Highlander IIC",
  "model": "2",
  "tonnage": 90,
  "techBase": "Clan",
  "rulesLevel": "2",
  "engine": "270 Fusion (Clan) Engine",
  "heatSinks": "11 Laser",
  "movement": {
    "walk": "3",
    "jump": "3"
  },
  "armor": {
    "total": "Standard(Clan)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "Endo Steel",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3060"
  ],
  "extras": {
    "mul id": "1525",
    "Config": "Biped",
    "role": "Juggernaut",
    "quirk": "difficult_eject",
    "Myomer": "Standard",
    "LA Armor": "28",
    "RA Armor": "28",
    "LT Armor": "29",
    "RT Armor": "29",
    "CT Armor": "42",
    "HD Armor": "9",
    "LL Armor": "35",
    "RL Armor": "35",
    "RTL Armor": "8",
    "RTR Armor": "8",
    "RTC Armor": "13",
    "Weapons": "14",
    "overview": "One of the most popular Star League BattleMechs, many a Highlander accompanied General Aleksandr Kerensky into exile. Some were mothballed, but many found their way into the toumans of the Clans.",
    "capabilities": "With the use of newer, lighter weapons, the damage potential of the Highlander has roughly doubled. The IIC also contains enough ammunition that it rarely needs to conserve any during Trials. Clan scientists were forced to rearrange the placement of some weapons within the 'Mech to allow it proper ammo feeds, but the design is largely unchanged. It carries the maximum amount of Ferro-Fibrous armor that can be crammed on the frame, fourteen and a half tons. As with the original, the IIC carries enough jump jets to move up to ninety meters at a time, allowing MechWarriors to execute the \"Highlander Burial\".",
    "deployment": "This new variant was introduced during the onslaught of fighting of the Jihad in 3072. The variant is fitted out as an all-range combatant with enhanced anti-infantry fighting. It has retained its Gauss Rifle & Streak SRM 6, while designs exchanged the LRMs for three ATM 6 Launchers with four tons of ammunition. The Medium Pulse Lasers, have been exchanged for trio of ER Medium Lasers. For its anti-infantry role, it has six AP Gauss Rifles fitted into its left arm, with a ton of ammunition for them. Endo Steel has been added to the design, allowing for slight increase in its armor protection.",
    "history": "As technology advanced, the weapons systems were upgraded until the design known as the Highlander IIC finally emerged. Though no new Highlanders have been produced in over a century, several hundred are still in scattered use throughout the touman of every Clan.",
    "manufacturer": "W-7 Facilities (Refit)",
    "primaryfactory": "Weingarten",
    "systemmanufacturer": "TARGETING:C-12 Mk. III with Artemis IV FCS"
  },
  "era": "3072",
  "displayName": "Highlander IIC 2",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}