{
  "name": "Kodiak",
  "model": "4",
  "tonnage": 100,
  "techBase": "Clan",
  "rulesLevel": "2",
  "engine": "400 XL (Clan) Engine",
  "heatSinks": "20 Double",
  "movement": {
    "walk": "4",
    "jump": "0"
  },
  "armor": {
    "total": "Standard(Clan)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "Endo Steel",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3058"
  ],
  "extras": {
    "mul id": "1808",
    "Config": "Biped",
    "role": "Missile Boat",
    "quirk": "distracting",
    "Myomer": "Standard",
    "LA Armor": "32",
    "RA Armor": "32",
    "LT Armor": "32",
    "RT Armor": "32",
    "CT Armor": "40",
    "HD Armor": "9",
    "LL Armor": "34",
    "RL Armor": "34",
    "RTL Armor": "10",
    "RTR Armor": "10",
    "RTC Armor": "15",
    "Weapons": "7",
    "capabilities": "Though not taken to the same extreme as other Clan Totem 'Mechs, the Kodiak does epitomize the Ghost Bears' method of warfare, combining an impressive defensive platform with surprising amounts of speed and firepower. Its massive 400-rated XL Engine propels the Kodiak to a maximum speed of 64.8 km/h, while seventeen and a half tons of Compound 12A2 gives it impressive armor protection. Though it mounts an incredible amount of firepower, even the use of twenty double heat sinks cannot prevent overheating problems when they are all fired simultaneously, though most MechWarriors learn to use their weapons sparingly and love the 'Mech's ability to deliver a massive knockout punch. The Kodiak incorporates the Garret L20 as its communications system, and uses the RCA Instatrac Mark IX for targeting, however the \"claws\" mounted on both of its arms are purely aesthetic.",
    "deployment": "This variant mounts an Artemis IV FCS enhanced LRM-20 and a pair of ER Medium Lasers in each arm. For additional short range firepower, an LB 20-X AC is carried in the right torso.",
    "history": "The vast majority of Kodiaks are used by the Ghost Bears, and indeed was exclusive to them in the first years since its introduction. Of those which are found in other toumans, Clan Snow Raven has the largest share, payment for their help in relocating to the Inner Sphere, followed by Clan Goliath Scorpion and Clan Cloud Cobra. Among the Crusader Clans though, only Clan Ice Hellion fields a handful of these 'Mechs. As a interesting note, and proof of the expansion of the Kodiak, at least two of these mechs were found in a Smoke Jaguar unit on planet Asgard, during Operation Bulldog.",
    "manufacturer": "Bergan Industries",
    "primaryfactory": "Alshain",
    "systemmanufacturer": "TARGETING:RCA Instatrac Mark IX"
  },
  "era": "3066",
  "displayName": "Kodiak 4",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}