{
  "name": "Kodiak II",
  "model": null,
  "tonnage": 100,
  "techBase": "Clan",
  "rulesLevel": "2",
  "engine": "400 XL (Clan) Engine(IS)",
  "heatSinks": "20 Clan Double",
  "movement": {
    "walk": "4",
    "jump": "0"
  },
  "armor": {
    "total": "Standard(Clan)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "Clan Endo Steel",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3145 The Clans"
  ],
  "extras": {
    "mul id": "6295",
    "Config": "Biped",
    "role": "Missile Boat",
    "quirk": "distracting",
    "myomer": "Standard",
    "LA armor": "33",
    "RA armor": "33",
    "LT armor": "32",
    "RT armor": "32",
    "CT armor": "46",
    "HD armor": "9",
    "LL armor": "42",
    "RL armor": "42",
    "RTL armor": "10",
    "RTR armor": "10",
    "RTC armor": "15",
    "Weapons": "12",
    "overview": "Designed for Clan Ghost Bear, the Kodiak II is an Assault Class BattleMech which was first produced during the last decade of the thirty-first century.",
    "capabilities": "The 'Mech was engineered so it could serve as both a Command 'Mech and as a powerful assault 'Mech via a fitting of a heavy arsenal of missiles and a large array of energy weaponry. The design is based on the fourth variant of the original Kodiak. The Kodiak II is known for its Command facilities and its endurance. The powerful 'Mech carries 19 tons of Alshain Weapon's Forging AD56 Standard armor, giving it heavy resistance against weapons fire directed at it. At the heart of the machine is a 400-rated Extra-Light Fusion Engine, which while not as quick as other designs its weight saving qualities allows the 'Mech to carry is substantial weapons load out.",
    "deployment": "The Kodiak II's long-range weaponry revolves around pair of arm mounted Type XX \"Great Bow\" 20-tubed Long-Range Missile Launchers, backed up by a single 10-tubed Type X \"Short Bow\" model found in the left torso. These missile launchers are guided by Artemis IV Fire Control Systems, allowing the 'Mech weapons to deliver its multiple tons of ammunition on target. Backing up the missile launchers is an Clan Mk. XVII Extended Range Particle Projection Cannon, found in the right torso. While it does need to close into brawling range to use them, the Kodiak II has 8 Series 1 Extended Ranged Small Lasers split between the 'Mech's two arm actuators. All the 'Mech's energy weapons are tied into a Targeting Computer found in the center torso.",
    "history": "The Kodiak II would become a favorite design within the Clan Ghost Bear touman, being produced on Alshain at the Alshain Weapons factory. One of the Kodiak II's noted actions was during a border skirmish on the world of Jabuka, wherein elements of Clan Jade Falcon's 53rd Battle Cluster tangled with the 2nd Bear Regulars commanded by Star Colonel Anton Hall from the cockpit of a Kodiak II. The 'Mech would show its perseverance in the face of the 53rd's artillery bombardment of the Star Colonel's surviving units and ended up being the deciding factor which won the battle for the Ghost Bears.",
    "manufacturer": "Alshain Weapons",
    "primaryfactory": "Alshain",
    "systemmanufacturer": "TARGETING:RCA Instatrac Mark IX with Artemis IV"
  },
  "era": "3095",
  "displayName": "Kodiak II",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}