{
  "name": "Locust",
  "model": "LCT-1L",
  "tonnage": 20,
  "techBase": "Inner Sphere",
  "rulesLevel": "2",
  "engine": "160 Fusion Engine(IS)",
  "heatSinks": "10 Single",
  "movement": {
    "walk": "8",
    "jump": "0"
  },
  "armor": {
    "total": "Standard(Inner Sphere)"
  },
  "armorByLocation": {},
  "internalByLocation": {},
  "structure": "IS Standard",
  "cockpit": null,
  "gyro": null,
  "weapons": [],
  "equipment": [],
  "ammo": [],
  "bv": null,
  "cost": null,
  "sources": [
    "TRO: 3039"
  ],
  "extras": {
    "generator": "MegaMek Suite 0.50.02-SNAPSHOT on 2024-12-30",
    "mul id": "1898",
    "Config": "Biped",
    "role": "Scout",
    "quirk": "ubiquitous_is",
    "myomer": "Triple-Strength",
    "LA armor": "4",
    "RA armor": "4",
    "LT armor": "8",
    "RT armor": "8",
    "CT armor": "10",
    "HD armor": "8",
    "LL armor": "8",
    "RL armor": "8",
    "RTL armor": "2",
    "RTR armor": "2",
    "RTC armor": "2",
    "Weapons": "3",
    "overview": "The Locust is undoubtedly one of the most popular and prevalent light BattleMechs ever made. First produced in 2499, the almost dozen distinct factories manufacturing the design quickly spread it to every power in human space. Its combination of tough armor (for its size), exceptional speed, and most importantly, low cost have all contributed to the Locust's success. It remains the benchmark for many scouting designs, and its continual upgrades have ensured that it remains just as effective with every new conflict that appears.",
    "capabilities": "As the Locust was first developed as a recon platform, speed is paramount to the design's philosophy. While many variants change the weaponry to fill specific tasks or purposes, Locusts are nearly always pressed into service in ways where they can best take advantage of their speed. When in line regiments, they can act as a deadly flankers or harassers, and are often used in reactionary roles to quickly plug holes in a fluid battle line. The structural form of Locusts themselves are their greatest weakness; with no hands, they are disadvantaged in physical combat and occasionally have difficulty righting themselves after a fall.",
    "deployment": "One of the most common designs even produced, even the smallest mercenary or pirate outfits will often field one or more of the design. Production for the Locust has continued uninterrupted for centuries, and it plays an important role in the militaries of many smaller nations. The -1L was a Liao testbed for Triple-Strength Myomer. Only appearing after the end of the Fourth Succession War, the -1L was one of a series of attempts to find a TSM compound that would not combust when exposed to the anti-myomer \"green gas\".",
    "systemmanufacturer": "TARGETING:O/P",
    "systemmode": "TARGETING:911"
  },
  "era": "3030",
  "displayName": "Locust LCT-1L",
  "_source": {
    "origin": "MegaMek mm-data (meks)",
    "license": "CC BY-NC-SA 4.0",
    "license_url": "https://creativecommons.org/licenses/by-nc-sa/4.0/",
    "copyright": "MegaMek Data © 2025 The MegaMek Team"
  }
}