{
  "name": "Loki",
  "chassis": "Loki",
  "model": "E",
  "mulId": 1927,
  "config": "Biped Omnimech",
  "techBase": "Clan",
  "era": 3069,
  "source": "TRO: Clan Invasion",
  "rulesLevel": 2,
  "role": "Sniper",
  "mass": 65,
  "engine": "325 XL (Clan) Engine(IS)",
  "structure": "IS Standard",
  "myomer": "Standard",
  "heatSinks": "13 Double",
  "movement": {
    "walk": 5,
    "jump": 5
  },
  "armor": {
    "type": "Standard (Clan)",
    "head": 9,
    "centerTorso": 17,
    "rightTorso": 14,
    "leftTorso": 14,
    "rightArm": 11,
    "leftArm": 11,
    "rightLeg": 15,
    "leftLeg": 15,
    "rearCenterTorso": 8,
    "rearRightTorso": 7,
    "rearLeftTorso": 7,
    "total": 128
  },
  "quirks": [
    "searchlight"
  ],
  "weapons": [
    {
      "type": "HAG/20",
      "location": "LA"
    },
    {
      "type": "ER Large Laser",
      "location": "RA"
    },
    {
      "type": "ER Large Laser",
      "location": "RA"
    },
    {
      "type": "LRM 10",
      "location": "RT"
    }
  ],
  "locations": {
    "leftArm": [
      "Shoulder",
      "Upper Arm Actuator",
      "CLHAG20 (omnipod)",
      "CLHAG20 (omnipod)",
      "CLHAG20 (omnipod)",
      "CLHAG20 (omnipod)",
      "CLHAG20 (omnipod)",
      "CLHAG20 (omnipod)",
      "Hyper-Assault Gauss Rifle/20 Ammo (omnipod)",
      "Hyper-Assault Gauss Rifle/20 Ammo (omnipod)",
      "HAG/20"
    ],
    "rightArm": [
      "Shoulder",
      "Upper Arm Actuator",
      "Lower Arm Actuator",
      "CLERLargeLaser (omnipod)",
      "CLERLargeLaser (omnipod)",
      "ER Large Laser",
      "ER Large Laser"
    ],
    "leftTorso": [
      "Fusion Engine",
      "Fusion Engine",
      "Jump Jet (omnipod)",
      "Jump Jet (omnipod)"
    ],
    "rightTorso": [
      "Fusion Engine",
      "Fusion Engine",
      "Jump Jet (omnipod)",
      "Jump Jet (omnipod)",
      "CLLRM10 (omnipod)",
      "Clan Ammo LRM-10 (omnipod)",
      "LRM 10"
    ],
    "centerTorso": [
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Gyro",
      "Gyro",
      "Gyro",
      "Gyro",
      "Fusion Engine",
      "Fusion Engine",
      "Fusion Engine",
      "Jump Jet (omnipod)"
    ],
    "head": [
      "Life Support",
      "Sensors",
      "Cockpit",
      "Sensors",
      "Life Support"
    ],
    "leftLeg": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator"
    ],
    "rightLeg": [
      "Hip",
      "Upper Leg Actuator",
      "Lower Leg Actuator",
      "Foot Actuator"
    ]
  },
  "text": {
    "overview": "The Hellbringer is a very widespread design developed by Clan Hell's Horses. However, due to its poor armor, the Hellbringer is often passed over for more robust OmniMechs.",
    "capabilities": "This support variant uses a pair of ER Large Lasers for consistent damage. An LRM 10 supports them, while a Hyper-Assault Gauss Rifle 20 with twelve shots provides a high-damage threat.",
    "deployment": "",
    "history": "The Inner Sphere first encountered the Hellbringer facing Clan Jade Falcon, which favors the design for its immense offensive potential. Earning the codename Loki by Galen Cox, an AFFC officer who declared each of the Hellbringer's various versions as an \"utterly mad configuration,\" the 'Mech does at first glance appear to be highly unusual, mounting a spread of weapons, anti-personnel equipment and electronics. The Hellbringer utilizes a standard internal structure, and has decent mobility, with a top speed of 86.4 km/h. Though it has vast firepower at its disposal, the design is not particularly durable, mounting a mere eight tons of Standard armor, and the Hellbringer is not particularly suitable for defensive situations or extended engagements. In the aftermath of the Battle of Tokasha and the loss of Tokasha Mechworks, the Hell's Horses began developing several OmniMechs. Only the Hellbringer met with success. Development time for the Hellbringer was reduced through the use of modules used in the Summoner. Despite the poor armor, the Hellbringer devotes almost 43% of its mass to pods, allowing for great offensive potential. The design spread quickly after its introduction for two reasons: the Horses promptly lost the primary production facility, and used their remaining production to curry favor with other Clans through trade and gifts. After The Wars of Reaving in Clan Space, the Hellbringer would fall out of favor with the surviving Home Clans due in part to its association with the Inner Sphere based Clans. The design would be replaced by the Ebon Jaguar in military service of those in Clan Space, with the exception of Clan Coyote which still fields the 'Mech. Even after the introduction of the updated and upgraded Loki II successor design in 3121, Clan Jade Falcon would continue to produce the cheap and easy to manufacture original version on Sudeten during the Dark Age era, with disgraced, solahma or even just overly aggressive warriors still finding its offense over defense focus desirable."
  },
  "manufacturers": {
    "primary": [
      "Various",
      "Olivetti Weaponry"
    ],
    "primaryFactory": [
      "Various",
      "Sudeten"
    ],
    "systems": {
      "chassis": "T-E H65 Standard",
      "engine": "Fusion 325 XL",
      "armor": "Forging Omni-H24",
      "communications": "CH2B Alpha-Com",
      "targeting": "Version Delta-II TTS(A)"
    }
  }
}